[
  {
    "word": "A-",
    "meanings": [
      {
        "definition": "Represents sound of a in 'car'. The a in 'cat' is not used. The sound in 'cake' is rare, but usu. in Swk.M. for final -ai",
        "examples": [
          "written ei. Iban has no article, definite or indefinite, but uses num. cl. where necessary",
          "e.g. batang, buah, igi', iko', iti'"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "aba",
    "meanings": [
      {
        "definition": "(M., di-) At, in, near, ba",
        "examples": [
          "sida' karam a. Batu Rumah lalu tawak ulih sida' bedagang nyau magang, their boat went under at House Rock and all the gongs they'd got by trading were lost"
        ],
        "synonyms": [
          "APAK"
        ]
      },
      {
        "definition": "Pleasant smell, angit",
        "examples": [
          "nyampau a. indu' nya' mansa'! what a perfume that woman who passed uses!",
          "ngaba amai bau bungainya', that flower has a very strong scent"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "abab",
    "meanings": [
      {
        "definition": "For ABAP, wild betel-vine",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "abah",
    "meanings": [
      {
        "definition": "Cut made in a tree for felling, under-cut",
        "examples": [
          "a. nuan enda' manah, you haven't cut it properly",
          "ia ngabah-ka dulu' legi' aku nimbal, he first makes a cut on his side, then I make one on my side"
        ],
        "synonyms": []
      },
      {
        "definition": "Wedge-shaped chips from a felling cut",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "abak",
    "meanings": [
      {
        "definition": "For ABAH, undercut",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "abang",
    "meanings": [
      {
        "definition": "Title of M. men (women, Dayang) whose ancestors were migrants from Sumatra (Mengkabau) ', (Br.) awang, pengiran",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "M. Administrative Officer in Sarawak Civil Service. In 1840, local rulers were A. and they formed most of the Service until 1941",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Indai A., Indai Ulup, celestial manang (and mythical ancestress of the M.?)",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "(in Bugau) Term of endearment used to a boy",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Betapan a., support someone in distress; cf. gusong",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "abap",
    "meanings": [
      {
        "definition": "Wild betel-vine (SIRIH), abab",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "abar",
    "meanings": [
      {
        "definition": "Stir or dabble in water",
        "examples": [
          "anak mit nya' ngabar ai', that child is dabbling"
        ],
        "synonyms": []
      },
      {
        "definition": "Check way with a paddle",
        "examples": [
          "ia ngabar ai', he checked the boat's way",
          "a.-a. dulu'! hold her up!"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "abas",
    "meanings": [
      {
        "definition": "Examination, reconnaissance, go and see, visit, examine, look into, hear a case",
        "examples": [
          "a. ia agi' mekang, his examination is not thorough",
          "a. li' ia udah badu', go and see if he has finished (or stopped)",
          "ia baru pulai ngabas bubu, he has just come back from inspecting his fish-trap",
          "aku ka' ngabas munsoh enti' ia angkat, I'll reconnoitre the enemy (and see) if they have moved",
          "sida' regang mirah peng-a. orang sakit, those of the Red Cross go in for visiting the sick"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "abau",
    "meanings": [
      {
        "definition": "Long narrow fishtrap set baited with wouth upstream in fast water",
        "examples": [
          "penoli a. ulih ikan, the trap is full of fish",
          "sida' nyau tigabau Pagi tadi', they have gone to make (and use) lishtrap this morning",
          "pel-a., ground bait"
        ],
        "synonyms": [
          "BUBU"
        ]
      }
    ]
  },
  {
    "word": "abi",
    "meanings": [
      {
        "definition": "Wound, cut, scar (rukul), mark, crack, spot, flaw",
        "examples": [
          "a. telih ia dalam, his wound is deep",
          "a. ukir ia nyamai di-tunda', his carving (marks, cuts) is easy to imitate",
          "a. pangka' nitar, scar made by lightning strike (e.g., on tree)",
          "aku ti' ngabi babi nya', it was I who wounded that pig",
          "kayu' nya' ber-a., that tree is cut into",
          "mangkok tu' ber-a., this cup is cracked",
          "ia ngabi kayu', he cut the tree (to start felling it)"
        ],
        "synonyms": [
          "LITAN"
        ]
      },
      {
        "definition": "A. besi, mutually agreed boundary of farm, \"mark of iron\" where initial ritual clearing and tree-marking has been done at PANGGUL rites. It is an offence (pemali) to encroach upon or interfere with land so marked unless agreed payment (tungkus asi') has been made",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Space (underneath)",
        "examples": [
          "ka a. rumah anang meda', enggai-ka ngumbai ngiga' serenti jani', don't look into the space under the house, lest they should think you seek a pig tusk (amulet)"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "abis",
    "meanings": [
      {
        "definition": "Everyone, all, the whole, entirely",
        "examples": [
          "a. tindok sida', they've all gone to sleep",
          "telu' nya' a. di-empa' Apai Aloi, all those eggs were eaten by Apai Aloi",
          "baju aku a. basah laban peloh, my shirt is all soaked with sweat"
        ],
        "synonyms": []
      },
      {
        "definition": "(M., habis) Finished, used up",
        "examples": [
          "uji ngabis-ka asi' nya', try and eat up that rice",
          "semakau aku udah a., I am out of tobacco",
          "tu' peng-a. pemakai kami, this is the last of our food",
          "tu' peng-a. jerita, this is the end of the story",
          "enggau peng-a. tulang, with all one's might",
          "enggau peng-a. penau', to the best of one's ability",
          "enggau peng-a. pengerindu' ati, with very great pleasure"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "abit",
    "meanings": [
      {
        "definition": "Sweet juice tapped from palm blossom",
        "examples": [
          "ai' a. tu' masam bendar, this toddy is very sour",
          "dini nuan ngabit ai' a. tu' bangat manis? where did you get this very sweet toddy?"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "abok",
    "meanings": [
      {
        "definition": "(Swk.M., keribang) Buah a., Sweet Potato, Ipomoea (or Convolvulus) batatas, ubi randau",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Remainder of plant that can be used or worked again",
        "examples": [
          "sida' nyau ngabok kubal sida' kamari', they went yesterday to work over (again) the rest of their rubber plants"
        ],
        "synonyms": []
      },
      {
        "definition": "(M., haboh) Mess, shavings, sawdust, dust, padi bran",
        "examples": [
          "bilik tu' be-a.-a., this room is in a mess"
        ],
        "synonyms": [
          "AMPA'"
        ]
      },
      {
        "definition": "Dried prawn meal properly consisting of tiny shrimps (bubok)",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Man's name",
        "examples": [
          "Pengulu A. anak Jalin of Sebauh"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "Abong",
    "meanings": [
      {
        "definition": "Son of Ribai and son-in-law of Pulang Gana (earth deity)",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "abu",
    "meanings": [
      {
        "definition": "(M.) Dust, fine ash, abus",
        "examples": [
          "cf. abok"
        ],
        "synonyms": []
      },
      {
        "definition": "A. belap, conjuring, card tricks",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "(Ar., 'father', 'originator') Ancestral spirit (antu) of the times after BEJI. He is called A. datai ari munggu' tinggang guntur, Abu from the hill struck by thunderbolts; his son is Dising datai ari perencing pandang lambur, Dising from under the red gleam of the westering sun; and his son, Bedali tiang balan encegi sarat buat balang bedabong, Bedali the upstanding pillar strong to bear many grinning head trophies. Bedali's wife is Antuk nyinok langgong tegilong, Antuk the quiet woman of the plains (quiet as a top 'sleeping' as it spins); their daughter is Dayang Kumanggasing merengong, the Lady Kumang of the humming spinning-wheel; and their son is Bedam (or Medam) ngembuan danau gelong ke bungkong, Bedam the Spinner whose is the lake around the gnarled tree (or? who holds the curving lakes of Gelong). Bedam's wife is Jawai mu pong padong dua rangkat tincin mau tinjau baka be lap, Jawai of the double waterfall (or? whose is the canopied bed) who wears the dazzling gold ring that to behold makes men stupid; their son is Bedang apai mandang dundang surong, Bedang the wise one ever searching hither and yon. Bedang's wife is Dara Saur (sa-aur, gold bamboo?) pengukur mata isau pengundur bala nyerang, Dara Saur who foretells the fortunes of the swords and the swordsmen who set forth to war. Bedang and Dara Saur are the parents of LANG",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "abul",
    "meanings": [
      {
        "definition": "Float, buoy, raft",
        "examples": [
          "a. teras tu' enggau kayu' nyelutong nya', float this ironwood with that jelutong log",
          "pelai' tu' tau' enggau ngabul- ka ma' kitai, this pelai' wood will do to float our packs"
        ],
        "synonyms": []
      },
      {
        "definition": "Butt of a blowpipe dart (I. AJA')",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "abup",
    "meanings": [
      {
        "definition": "Fool",
        "examples": [
          "o! a. nuan tu'! you fool!"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "abur",
    "meanings": [
      {
        "definition": "(in Undup, rebur) State of panic, desolation, or confusion resulting from war; cf. kacau",
        "examples": [
          "menoa nyau a., the country is desolate"
        ],
        "synonyms": []
      },
      {
        "definition": "Widely known; cf. ambur",
        "examples": [
          "pemeli' ia a. ba kami ditu', his folly is known to us all round here",
          "ia ngabur-ka berita anak raja ti' ada, he spread the news of the prince's birth"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "abus",
    "meanings": [
      {
        "definition": "Ashes, abu",
        "examples": [
          "ambis terebai a. laban ribut, all the ashes are being blown about by the wind"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "acak",
    "meanings": [
      {
        "definition": "(of hearing) Destroyed (lacak), deaf, usu. tuli'",
        "examples": [
          "a. bendar ia nya', he is very deaf",
          "nyawa nuan ngacak-ka pending aku, the noise you make deafens me"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "acang",
    "meanings": [
      {
        "definition": "Domestic pigeon",
        "examples": [
          "wild, puna'"
        ],
        "synonyms": []
      },
      {
        "definition": "Man's name",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "acap",
    "meanings": [
      {
        "definition": "Reached by the tide or flood water",
        "examples": [
          "perau' aku baru a., the water is just up to my boat (to float it)",
          "pasang ngacap-ka batu nya', the tide reaches that stone (just covers it)"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "acar",
    "meanings": [
      {
        "definition": "Small metal plate with several fish-hooks, spoon-bait, spinner",
        "examples": [
          "uji a. ikan nya', try and catch that fish with a spinner",
          "aku ka' ngacar, I shall go spinning",
          "ia peng-a. bendar, he does a lot of spinning for fish"
        ],
        "synonyms": []
      },
      {
        "definition": "(Pers., Hind.) Indian spiced pickle of fruit or vegetable",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "Acih",
    "meanings": [
      {
        "definition": "Province of N. Sumatra",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Padi A., varieties of high-yielding swamp rice",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "acir",
    "meanings": [
      {
        "definition": "(with ka) Scatter",
        "examples": [
          "ia ngacir-ka umpan, she scattered food for the fowls"
        ],
        "synonyms": []
      },
      {
        "definition": "Disperse, be dispersed",
        "examples": [
          "anembiak ia ngacir sa-belah padang, his followers are scattered over the field",
          "duit aku ngacir kia'-kia', my money is well distributed (i.e., my eggs are not all in one basket)",
          "rumah kami nyau bacir (be-a), our house is (split up and) scattered"
        ],
        "synonyms": []
      },
      {
        "definition": "Act hastily or carelessly (i.e., 'scattering' effort)",
        "examples": [
          "kereja a., careless work"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "acok",
    "meanings": [
      {
        "definition": "Thrust, pierce, poke (tacok)",
        "examples": [
          "a. ia enda' ngena', his attempt to pierce it failed",
          "ia ngacok rusok aku, he prodded me in the ribs",
          "ia ngacok rusok orang nya' enggau sangkoh, he thrust a spear into that man's side",
          "anang be-a. -ka tunjok nuan ngagai lubang nya', don't keep putting your finger into that hole",
          "pemedis asai kai di-a., piercing (stabbing, sharp) pain"
        ],
        "synonyms": []
      },
      {
        "definition": "Incite (acu'), persuade",
        "examples": [
          "ia ngacok aku belay a', he egged me on to quarrel",
          "ia ngacok aku enggau jako' awak-ka aku muai pengarap, he tried to persuade me to abandon my faith"
        ],
        "synonyms": [
          "PERANSANG"
        ]
      }
    ]
  },
  {
    "word": "acu'",
    "meanings": [
      {
        "definition": "Provocation, incite, provoke, set on, interfere with in order to start a quarrel, acok",
        "examples": [
          "a. ia bangat meransang hati aku, he set me on (to quarrel)"
        ],
        "synonyms": []
      },
      {
        "definition": "Feint",
        "examples": [
          "ia ngacu' aku enggau kiba', he made a feint at me with his left",
          "ia ngacu' udok enggau tulang, he teased (tundi') the dog with a bone (offering and snatching away)"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ada",
    "meanings": [
      {
        "definition": "Born, be born, give birth, adai",
        "examples": [
          "ia a. ditu', he was born here",
          "ia ngada-ka anak tengah malam, she gave birth at midnight",
          "peng-a., birth",
          "surat peng-a., birth certificate",
          "ia ngingat- ka liari peng-a., he is celebrating his birthday",
          "ber-a., parents",
          "karong meng-a., (poet.) mother",
          "a. lalu (matt), stillborn. From the quickening to cutting of first teeth the parents' activities are restricted"
        ],
        "synonyms": [
          "PENTI. A birth is attended by several midwives, is 'assisted' by pressure on the mother's abdomen, and announced by sounding a gong. Those present perform a BIAU sacrifice and their foreheads are touched with the blood. The afterbirth (entemuni') is put in a bag and hung in the cemetery (pendam) or an old house site (tembawai). The baby (anak) is sprinkled with ground areca nut (pinang) and zedoary (lawang) and bandaged (balul)",
          "it is wrapped in cloth and laid on a spathe of areca palm, with a ritual cloth (pua') hung over it. One of the women washes the child and cuts the cord, for which service her fee may be a piece of iron, a plate, and some tina'. The mother has ground ginger (LIA') put on her abdomen, is bandaged, sits with her back to a fire (KINDU'), drinks an infusion of ginger, and kneads herself with an adze haft (peredah) to remove discharge",
          "this lasts about a month. Child's first bath, (gawai) mandi' anak"
        ]
      },
      {
        "definition": "Supply",
        "examples": [
          "ia ngada-ka pemakai aku, he supplies my provisions",
          "ngada-ka pengawa' manah agi' ka orang periman, to give a better service to the public"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "adai",
    "meanings": [
      {
        "definition": "Born, be born, give birth, ADA",
        "examples": [
          "ia ngadai-ka anak dua besapit, she gave birth to twins"
        ],
        "synonyms": []
      },
      {
        "definition": "Supply, provide, ADA",
        "examples": [
          "ia ngadai-ka bekal, he supplies provisions"
        ],
        "synonyms": []
      },
      {
        "definition": "(M., ada) Have, possess, usu. bisi'",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Man's name",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Wong A., rapid in the Kanowit",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "adai-pen",
    "meanings": [
      {
        "definition": "Indeed, because, now",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "adak",
    "meanings": [
      {
        "definition": "Harpoon; gen. for spear, SANGKOH",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "adam",
    "meanings": [
      {
        "definition": "Man's name",
        "examples": [
          "A. enggau Iba, Adam and Eve"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "adan",
    "meanings": [
      {
        "definition": "Post, base",
        "examples": [
          "a. angkat, (in races) starting point",
          "a. menang, winning post",
          "a. limbak, (on rifle range) firing point"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "adang",
    "meanings": [
      {
        "definition": "Expect, watch, look out for, sadang",
        "examples": [
          "sida' ngadang bala munsoh, they are expecting the enemy",
          "aku ngadang (-ka) nuan datai, 1 expect you to come",
          "ia di-a. (-ka) aku datai pagila', I am expecting him to come tomorrow"
        ],
        "synonyms": []
      },
      {
        "definition": "(M.) Ngadang! get ready!; sida' ngadang-ka munsoh, they are preparing to meet the enemy; ngadang-ka diri', guard oneself; sigi' ngadang-ka ternuai (or, nemuai), only getting ready for visitors (or, to go on a visit). ADING",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "adap",
    "meanings": [
      {
        "definition": "Aspect, position",
        "examples": [
          "kini a. dapur kita'l where (in which position) are you putting your fireplace (kitchen)?",
          "a. kanan, on the right"
        ],
        "synonyms": []
      },
      {
        "definition": "Face, seek an interview, go before, appear before, present oneself",
        "examples": [
          "kami tau' ngadap Raja barang maia, we can meet the Rajah at any time",
          "maioh orang ka' ngadap ia, many people want an interview with him",
          "aku ngadap ngagai Raja, 1 went before the Rajah",
          "aku ngadap-ka pengawa' tu' ngagai Raja, I brought this matter before the Rajah"
        ],
        "synonyms": [
          "TUNGA'"
        ]
      },
      {
        "definition": "On the side of, towards",
        "examples": [
          "aku ngambu' pun rian tu' ngadap-ka ari indai aku, I claim this durian tree from my mother's side"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "adar",
    "meanings": [
      {
        "definition": "Ngadar, arrange, put in order",
        "examples": [
          "ia ngadar- ka pejalai aku, he arranges my movements",
          "ia ngadar-ka penudok pengabang, he arranges the seating for the guests, he seats the guests in (proper) order"
        ],
        "synonyms": [
          "ADU"
        ]
      }
    ]
  },
  {
    "word": "adat",
    "meanings": [
      {
        "definition": "Way of life, basic values, culture, accepted code of conduct, manners, and con-ventions. A. safeguards the state of affairs in which all parts of the universe are healthy and tranquil (celap, lantang) and in balance. Breaches of a. disturb this state and are visited by 'fines' or contributions to the ritual neces-sary to restore the balance and to allay the wrath, whether of individuals, the community, or the deities",
        "examples": [
          "TUNGGU. Gen. a. means custom, law, behaviour, tradition"
        ],
        "synonyms": [
          "anang muai a. lama', don't discard old traditions; a. bekurong, curfew; a rumah (-tangga'), rules of the house; nunda'-ka a. aki'-ini', follow the traditions of your forefathers; a. ti' ngasoh nuan kena' ukum, the law which condemns you to be fined; a. semilan bengkah, the Nine Cardinal Principles (of the Constitution, 1941 and 1946); ber-a., well behaved; enda' ber-a. nuan tu', nuan tu' nadai a., you have no manners; a. ia kasar, his behaviour is rude; be-a., entitled to certain forms of (ritual) respect (basa)\\ ia orang be-a., he must be treated with respect"
        ]
      },
      {
        "definition": "(H.,. 2 nd Div.) Pig-tailed Macaque, NYUMBOH",
        "examples": [
          "kati a. kita' enti' orang ninggal-ka bini? what fine do you impose on a man who deserts his wife?",
          "berapa a. nuan enti' nuan bebunoh antu? what is your fee for (the rite of) killing the evil spirit? adau"
        ],
        "synonyms": []
      },
      {
        "definition": "(in Ulu Ai, Ulu Rejang) Gibbon Ape, EMPELIAU",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "adi'",
    "meanings": [
      {
        "definition": "(M. adek) Any younger relative of the same generation",
        "examples": [
          "ia ngadi'-ka aku, he calls me younger brother",
          "ia baru ngadi', he has just got a younger brother",
          "ber-a. udok, half-brother or -sister"
        ],
        "synonyms": [
          "MENYADI'"
        ]
      }
    ]
  },
  {
    "word": "adih",
    "meanings": [
      {
        "definition": "Exclamation of pain or surprise, adoh, akai",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ading",
    "meanings": [
      {
        "definition": "Array, make ready",
        "examples": [
          "bala ngading-ka diri', the men are arming, the army is getting ready",
          "a. -ka diri' nuan bejalai, get ready to start walking"
        ],
        "synonyms": []
      },
      {
        "definition": "Preparation or service of food, etc",
        "examples": [
          "a. ia manah endar, her arrangements for the food are excellent",
          "ia ngading-ka anak ia makai, she served her son",
          "ia ngading-ka anak ia ti' ka' datai, she is getting a meal ready for her son who will be coming",
          "pelandaingading BAhONG, song for the gathering (or making) of scented beads. ADANG"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "adoh",
    "meanings": [
      {
        "definition": "(M.) Exclamation of pain or surprise, adih, akai",
        "examples": [
          "a. -anang, spear or harpoon with opposing barb further from the point (i.e., thrust one way-'adoh', and the other-'anang')"
        ],
        "synonyms": []
      },
      {
        "definition": "Cry to a child to soothe it, 'There! There! '",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "adong",
    "meanings": [
      {
        "definition": "Freshwater fish Hampala sp., Barbus macrolepidotus (?),juak",
        "examples": [
          "KUANG"
        ],
        "synonyms": []
      },
      {
        "definition": "(colour of fighting cocks, manok) White with red wings",
        "examples": [
          "a. burik, white with light brown patches"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "adu",
    "meanings": [
      {
        "definition": "Arrange, put in order, adjust, mend (biki')",
        "examples": [
          "a. ia manah endar, he arranged things well",
          "ia ngadu-ka barang, he is arranging the goods",
          "ia ngadu-ka injin aku jampat amat, he repaired my (outboard) motor very quickly",
          "ia be-a. -ka bilik, she sets the room in order",
          "ia be-a., ia ber-a. diri', she dresses (is dressed) in her best",
          "a. tikai, straighten the mat"
        ],
        "synonyms": [
          "ADAR"
        ]
      },
      {
        "definition": "Arbitrate, arrange, settle, adjust",
        "examples": [
          "a. Pengulu nya' rurus bendar, that chief was very just in his arbitration",
          "ia ngadu-ka lay a', he settled the dispute",
          "ia peng-a. laya' kami sa-rumah, it is he who settles disputes in our house"
        ],
        "synonyms": []
      },
      {
        "definition": "Complaint, appeal",
        "examples": [
          "a. ia enda' di-dinga orang, his complaint is not listened to",
          "manah agi' enti' nuan ngadu- ka Perintah laya' nuan, it would be better to appeal to the Government about your case",
          "aku ka' ngadu ia ngagai tuai laban ia mantap utai aba pendai' kami, I lay a complaint against him before the headman because he slashed at things by our waterside (i.e. threatened assault)"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "adup",
    "meanings": [
      {
        "definition": "Breastbone of bird",
        "examples": [
          "hence for ajup, bowboard of boat (PERAU')"
        ],
        "synonyms": []
      },
      {
        "definition": "Meat of bird's breast, breast of chicken, didis",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "agak",
    "meanings": [
      {
        "definition": "Rotan basket with oval rim and narrow rectangular bottom, either large to be carried on the back, or small to be slung from the shoulder, raga'",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "agam",
    "meanings": [
      {
        "definition": "Consider, think, reckon that, mer-a., anggap",
        "examples": [
          "di-a. aku, I think that",
          "per-a., thought"
        ],
        "synonyms": [
          "PELABA'"
        ]
      }
    ]
  },
  {
    "word": "agang",
    "meanings": [
      {
        "definition": "Dry branches and twigs of fallen tree",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "agar-agar",
    "meanings": [
      {
        "definition": "Proud, boastful",
        "examples": [
          "ia nya' a. madah-ka diri' berani tang ia takut amai, he boasts of his bravery but is really a great coward"
        ],
        "synonyms": []
      },
      {
        "definition": "(M.) Jelly made from edible sea-weeds (Eucheuma, Gracilaria, Sphaerococcus, and other spp.) often coloured and flavoured with pandan (kerupok)",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "agas",
    "meanings": [
      {
        "definition": "(M.) Large whitish sandfly that bites only at night, empugau",
        "examples": [
          "KERINGIT"
        ],
        "synonyms": []
      },
      {
        "definition": "Man's name",
        "examples": [
          "Datu A., ancestor of some Betong Malays, related to Vatu Ayu",
          "A. Rantai Besi (Iron Chain) of the Ulu Ai who fought the Rajah in 19 th c"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "agi'",
    "meanings": [
      {
        "definition": "More (in comparison)",
        "examples": [
          "sigi' tu' manah a. ari nya', this one is better than that",
          "aku kering a. ari ia, I am stronger than he",
          "lama' a. manah a. deli, the longer (time) the better",
          "jarang endar ninga berita sida', anang telah a. betemu, we seldom hear news of them, let alone see them",
          "enti' aku di-takut di' anang a. antu, if you're frightened of me, how much more (scared you'd be) of a' ghost"
        ],
        "synonyms": []
      },
      {
        "definition": "Still",
        "examples": [
          "ia a. makai, he's still eating",
          "ia nadai a. ditu', he's not here any more",
          "ia badu' a. nyadi Pengulu, he has ceased to be a chief",
          "a. suba' ia, formerly",
          "maia menoa a. kacau kelia', when the countryside was still disturbed (i.e., by headhunting forays)",
          "a. taun nyin kamari', at the end of last year"
        ],
        "synonyms": []
      },
      {
        "definition": "More, again",
        "examples": [
          "beri' aku a'., give me some more",
          "uji a., try again"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "agong",
    "meanings": [
      {
        "definition": "The back, below the waist, punggong",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "First stage in formation of comb in a bee-hive (idang manyi')",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Spear (sangkoh), unid",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Hornbill (kenyalang), unid",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Kampong a.-a., high forest",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "(M.) Brief form of the titles of the Malaysian Head of State",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "agu",
    "meanings": [
      {
        "definition": "Platform or staging built over a stream or hollow but not necessarily crossing it, (hence) low 'jetty', log walk (batang) in swamp, latrine (jamban)",
        "examples": [
          "bridge, andau"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "agu'",
    "meanings": [
      {
        "definition": "Silly, stupid, idiotic, dumb (isu'), make oneself stupid",
        "examples": [
          "sayau anak ia a., it's a pity his child is dumb",
          "ia ngagu'-ka diri' bejako', he made himself appear stupid in conversation"
        ],
        "synonyms": []
      },
      {
        "definition": "Tremble, shiver from cold",
        "examples": [
          "aku celap bandar udah ngelaban ujan lalu ngagu', I was very cold from being in the rain and shivered"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "agui",
    "meanings": [
      {
        "definition": "Snake skin (?)",
        "examples": [
          "sida' Silih A., those who change their skins (i.e. snakes, esp. deities of Panggau)"
        ],
        "synonyms": [
          "slough the skin, silui"
        ]
      }
    ]
  },
  {
    "word": "agum",
    "meanings": [
      {
        "definition": "Small carved figure of wood, usu. of human form, made to protect a farm from pests (or house from illness or other evil) at gawai ball' UMAI, engkeramba'",
        "examples": [
          "PENTIK. The rite in the farm may be followed by one for Ribai in the form of a crocodile (baya)"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ah",
    "meanings": [
      {
        "definition": "Interjection (in difficulty)",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ai'",
    "meanings": [
      {
        "definition": "Water, liquid, liquor, juice, sap",
        "examples": [
          "a. amat, plain or cold water",
          "a. anggur, (M.) wine (of grapes)",
          "a. arak, rice spirit",
          "a. bah, river flood, a fresh",
          "a. GETAH, rubber latex",
          "a. idup, fresh water (untreated, not boiled, not rainwater)",
          "a. kembai, the river is swollen",
          "a. kemili, urine",
          "a. langkang, low water (through drought)",
          "a. madu, a. manyi', honey",
          "a. masin, salt or brackish water, sea water",
          "a. mata, tears",
          "a. mati, boiled (i.e., dead) water",
          "a. medok, (M.) tides at the neaps",
          "a. niur, coconut water (not the 'milk', santan)",
          "a. menoh, high water, high tide",
          "a. minyak, oil",
          "a. paya', swamp water (brown from peat), (fig.) beer (from the colour)",
          "a. paip. piped water",
          "a. tasik, sea water, the seas",
          "a. tuak, rice beer",
          "a. tusu, milk",
          "a. ujan, rainwater",
          "sida' meli a. ka gawai, they bought drink for the festival",
          "aku turun ka a., I am going down to the water (i.e. to fish or for a bath, the meaning being clear from what you carry)",
          "pemakai tu' be-a., this food is watery",
          "kuris ia bel-a., his sores are running",
          "mata aku bel-a., my eyes are watering",
          "getah bansa. baru tu' bel-a. amat, this new rubber clone is very high yielding"
        ],
        "synonyms": []
      },
      {
        "definition": "A. Rupa, Europe, the West (in gen. cultural and economic sense)",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "River, SUNGAI",
        "examples": [
          "A. Kakus, the Kakus River",
          "dia' kita' nyemerai a., at that point you cross the river",
          "a. nyau mansang (bah), the river is swelling (in Hood)"
        ],
        "synonyms": []
      },
      {
        "definition": "Names used in the Rimbas and Paku for some ritual drinks",
        "examples": [
          "a. basu', tuak served by young women to guests at entry to wash away any evil (e.g., omens, burong) they may unwittingly have brought",
          "a. beru-sebayan, ceremonial drink at gawai antu (lit., liquor of the Dead)",
          "a. buloh, an important drink (a. garong?) served in specially made bamboo cups (jalong?)",
          "a. garong, drink served at the climax of the gawai antu",
          "a. jalong timang, a. serarai, drinks served to senior fighting men by senior women who represent the leading women of Sebayan during timang jalong",
          "a. untong, a. aus, the 'thirst quencher', individ-ual share of drink divided by complex method into units of 100 (each being a small glass) according to age and rank"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "aidis",
    "meanings": [
      {
        "definition": "Nyamok a., mosquito Aedes sp",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "aih",
    "meanings": [
      {
        "definition": "Interjection, cf. kaih",
        "examples": [
          "a. deh! (in annoy-ance or mockery)",
          "a. ga'l (incitingsomeone)"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "aing",
    "meanings": [
      {
        "definition": "About to, preliminary of anything",
        "examples": [
          "a. jako' ka' bejalai, preliminary announcement of going on a journey"
        ],
        "synonyms": []
      },
      {
        "definition": "Abang A., (M.) officer of the 1890 s after whom the Simanggang Malay School is named, descended from the former rulers of Banting and connected by marriage with Tuanku Osman of Sibu",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ais",
    "meanings": [
      {
        "definition": "(Eng.) Ice, ai' batu",
        "examples": [
          "kupi a., iced coffee"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ait",
    "meanings": [
      {
        "definition": "Ngait, desire, long for, crave, covet",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Rely on, have confidence in",
        "examples": [
          "aku a. -ka ajar nuan, I have confidence in your advice",
          "semina ia agi' di-a. -ka aku, he is my only hope now",
          "ia balat endar sakit, tang aku agi' ngait-ka ia tau' bejako', he is still very ill but I am pinning my faith on the fact that he can still speak",
          "anang ngait-ka jako' ia ti' salah, don't attach too much importance to his hard words"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "aiyu",
    "meanings": [
      {
        "definition": "For AYU, plant-soul",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "aja'",
    "meanings": [
      {
        "definition": "Only, simply, saja', taja'",
        "examples": [
          "siko' ia a., he alone",
          "tu'a. jako'aku enggau nuan, I haven't anything else to say to you (or, to tell you)",
          "ia makai asi' a., he is eating (cooked) rice only"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ajal",
    "meanings": [
      {
        "definition": "(Ar.) Fate, destiny",
        "examples": [
          "a. kami ka' parai, kati ko' enggau? we must all die, and nothing can be done about it"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ajar",
    "meanings": [
      {
        "definition": "(M.) Teaching, warning, adivce",
        "examples": [
          "aku ingat-ka a. apai, 1 remember my father's teaching",
          "utai nya' ngelaban adat a. apai indai aku, that conflicts with what I was taught, is against my principles",
          "Indai ngajar ia betenun, Mother taught her weaving",
          "ia ngajar anembiak, he teaches the children",
          "sakali tu' aku agi' ngajar nuan, udah nya' enti' nuan agi' salah endang kena' ukum, this time I'm warning you, but if you do anything wrong again you will be fined",
          "anang takut ngajar ia, don't hesitate to correct him",
          "kami duai be-a. pangan diri', we counselled one another",
          "bel-a., learn, study",
          "pel-a., lesson, education, teaching, course of study",
          "peng-a., teacher"
        ],
        "synonyms": [
          "pupil, tarak"
        ]
      },
      {
        "definition": "A.-a., rudder head of M. type boat (PERAU')",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ajat",
    "meanings": [
      {
        "definition": "Dance with gong music, usu. solo, (a) miming combat when performed at rituals or for public display but (b) as 'party piece' may be topical or comic and show some ordinary activity of men or animals",
        "examples": [
          "lemi' ia ngajat, he (is supple and) dances well"
        ],
        "synonyms": [
          "TANDA', PENCA'. The dancer who leads the ngalu antu procession at a gawai is said to ngajat. A. has come to mean any Iban dance but the old processional dances have their own names",
          "BERAYAH"
        ]
      },
      {
        "definition": "Plaited basket or bag",
        "examples": [
          "ia mai' gari' ngena' a., he took his (change of) clothes in a basket"
        ],
        "synonyms": [
          "gen. PISAU"
        ]
      }
    ]
  },
  {
    "word": "ajeh",
    "meanings": [
      {
        "definition": "For AJIH, work wonders",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "aji",
    "meanings": [
      {
        "definition": "A. Bulan, Moon Rat Echinosorex gymnurus Raffles (and candidus). It is a pugnacious nocturnal burrowing insectivore living near water, a survivor from prehistoric times",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Lubang a., bubun a., fontanelle",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "(in old M. literature, 'royal', 'king') Keling a. bujang berani, Keling, the royal, the bold",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "A. ti'berani ngilah bulan, suku raja rengayan, Aji bold to go beyond the moon, youth of royal lineage (son of LANG and son-in-law to Pulang Gana)",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "(Ar., M., haji) Muslim who has made the pilgrimage to Mecca, the pilgrimage; bejalai (or nanga, nurun) a., go on the pilgrimage",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Bat, unid., sandah, minor omen 'bird' (burong)",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "A. Pelimpah, (in Skrang tradition) a leader of the dead (Sebayan)",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Kendi a., signs at the branching of paths on the way to Sebayan",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "A son of Dana Bayang, Saji (Se-a.) in written histories",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ajih",
    "meanings": [
      {
        "definition": "Miracle, work wonders, transform by magic",
        "examples": [
          "a. ia datai, perform a miracle and cause him to come",
          "Keling tau' a., Keling has magic powers",
          "ngajih, do wonders, perform miracles"
        ],
        "synonyms": []
      },
      {
        "definition": "Pray, wish that (of strong desire)",
        "examples": [
          "aku a. ia mati, I wish him dead",
          "a. -ka manah meh hari pagila', may it be a fine day tomorrow",
          "aku selalu ngajih-ka diri' betemu enggau ia, I'm always praying that I may meet him"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ajin",
    "meanings": [
      {
        "definition": "(Eng.) Agent, go-between, attorney, ijin",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ajir",
    "meanings": [
      {
        "definition": "Row, line",
        "examples": [
          "a. tiang, row of posts",
          "ia ngajir-ka surat bup, he put the books in a row",
          "nugal-ka anak padi be-a. nyamai amat mantun ila', if padi seedlings are planted out in rows the weeding will be much easier"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "aju",
    "meanings": [
      {
        "definition": "For ACU', provoke",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ajuh",
    "meanings": [
      {
        "definition": "Term of address used between men (only intimates), aloh",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ajuk",
    "meanings": [
      {
        "definition": "Thrust in, pierce, stick in, dip (in water) acok",
        "examples": [
          "ia ngajuk-ka tunjok di tekang asi', he stuck his finger in a lump of rice"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ajul",
    "meanings": [
      {
        "definition": "Tree Shorea macrantha Brandis, (M.) ENGKABANG bungkus",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ajum",
    "meanings": [
      {
        "definition": "Pierce (acok), poke, encourage, incite (acu')",
        "examples": [
          "a. ia enggau jako' awak-ka ia nyadi belay a', say something to him to make him start a quarrel"
        ],
        "synonyms": []
      },
      {
        "definition": "Woman's name",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ajup",
    "meanings": [
      {
        "definition": "Long raking bowboard of upriver boats (PERAU'), strengthened inside with heavy beam (pencalang) for safe passage through rapids",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "aka'",
    "meanings": [
      {
        "definition": "Bosom friend, term of address to a respected and much older person",
        "examples": [
          "ia ngaka'-ka aku, he calls me a",
          "cf. akan"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "akai",
    "meanings": [
      {
        "definition": "Interjection of wonder or pain, adih, adoh, atai",
        "examples": [
          "a. indai! oh, dear!"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "akal",
    "meanings": [
      {
        "definition": "(Ar.) Skill, craft, cunning, intelligence",
        "examples": [
          "ber-a., clever",
          "ngena' a. ngereja pengawa' tu', use your brains in doing this job",
          "ia bisi' a. ngaga' tu', he has a way ('dodge') for making these",
          "ia ngereja nya' enda' ber-a., he did it without thinking (planning) it out"
        ],
        "synonyms": []
      },
      {
        "definition": "Deceive, delude",
        "examples": [
          "ia ngakal aku, he tricked me",
          "ia udah di-a. mata ia, her eyes deceived her"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "akan",
    "meanings": [
      {
        "definition": "Distant cousin, polite form of address to a younger person; opp. of ENDUN (girls); cf. akal",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "akap",
    "meanings": [
      {
        "definition": "Thought, reasoning, think, cakap",
        "examples": [
          "aku ngakap-ka dulu', I will think it over"
        ],
        "synonyms": []
      },
      {
        "definition": "Mould",
        "examples": [
          "bau a., smell of rice kept too long",
          "be-a., mouldy"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "akar",
    "meanings": [
      {
        "definition": "Creeper or anything used for binding or gen. as substitute for rotan (except in mat-making)",
        "examples": [
          "kami ka' ngambi' a. entuyut er) ggau berumah, we are going to collect Pitcher plant (creeper, as lashings) for house-building"
        ],
        "synonyms": []
      },
      {
        "definition": "(M. bahar) A. bar, flexible coral t* orgonia sp., of which bracelets are sometimes made",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "A. laka, big creeper yielding incense wood Dalbergia parviflora Roxb",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Munsang a., Palm Civet Paradoxurus sp",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "akas",
    "meanings": [
      {
        "definition": "Screw Pine, unid",
        "examples": [
          "tikai a. dua lambar, tWoa- mats"
        ],
        "synonyms": [
          "gen. KERUPOK"
        ]
      }
    ]
  },
  {
    "word": "akat",
    "meanings": [
      {
        "definition": "Matter floating on water, rau",
        "examples": [
          "a. daun, a. rangkang, floating leaves, branches"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "akau",
    "meanings": [
      {
        "definition": "Strong light durable wood used for boats, Xylopia coriifolia Ridl",
        "examples": [
          "gen. kelili"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "aki'",
    "meanings": [
      {
        "definition": "(M.) Grandfather, term of address to men of one's grandparents' generation",
        "examples": [
          "a. datu', great-great-great-grandfather",
          "a. -ini', grandparents, forebears, ancestors",
          "a. puyang, great-grandfather",
          "a. umboh, great-great-grand-father",
          "a. ungkok, 'Man in the Moon', husband of Ini' Andan"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "akih",
    "meanings": [
      {
        "definition": "F'riend, companion, term of address between equals who are not related, bakih, unggal, (obs.) stranger",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "akik",
    "meanings": [
      {
        "definition": "(Ar.; in Bible only) Cornelian, any red stone of value",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "akil",
    "meanings": [
      {
        "definition": "(Ar., wakil) Agent, deputy, represent-ative; cf. ari",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "akim",
    "meanings": [
      {
        "definition": "(Ar. hakim) A judge",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "akit",
    "meanings": [
      {
        "definition": "(M., rakit) Raft, make or use a raft; ia be-a. -ka buloh, he is using (or making) a raft of bamboo; ia ngakit-ka batang, he made a raft of the logs; (without ka) ia ngakit kayu', he takes the timber in tow, he floats the wood on a raft (esp. for belian or other heavy wood that sinks)",
        "examples": [
          "gen. for boat, PERAU'"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "aku",
    "meanings": [
      {
        "definition": "(M. in limited senses for sahaya) I, me, my, mine",
        "examples": [
          "a. ka' bejalai, I want to travel",
          "ngembi' a., give me",
          "nya' perau' a., that's my boat",
          "nya' enggi' a., that's mine"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "aku'",
    "meanings": [
      {
        "definition": "Ngaku', treat as, acknowl-edge",
        "examples": [
          "ia ngaku' aku ka anak, he treats me as a son",
          "kami duai ber-a. diri' ka menyadi', we two adopt one another as brothers",
          "sida' enggai ngaku' menyadi' sida', they won't acknowledge their own brothers"
        ],
        "synonyms": []
      },
      {
        "definition": "Claim, akun",
        "examples": [
          "a. benda ia, claim his jar"
        ],
        "synonyms": []
      },
      {
        "definition": "Admit, confess, own, akun",
        "examples": [
          "a. penyalali nuan, confess your crime",
          "ia ngaku' semua berita nya', he admitted all these things",
          "ia enggai ngaku' kandong ia, he won't acknowledge paternity of her child",
          "(with enda') ia enda' ngaku' ngelaban aku, he refused to fight me"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "akun",
    "meanings": [
      {
        "definition": "(Swk.M.) Claim, admit, aku'",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "akup",
    "meanings": [
      {
        "definition": "Malay Bear, JUGAM",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Name for a black dog",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ala",
    "meanings": [
      {
        "definition": "Uncooked, underdone, partly done",
        "examples": [
          "engkayu' tu' agi' a., these vegetables are still only half cooked"
        ],
        "synonyms": []
      },
      {
        "definition": "Kayu' a., Rhododendron sp., raung",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "alah",
    "meanings": [
      {
        "definition": "(M.) Beaten, defeated, subdue, van-quish; sida' a. beperang, they were defeated in war; a. aku, I give up; ngalah-ka diri', control yourself; anang a. hati, don't give up, don't despair; sida' ngalah-ka bala munsoh, they defeated the enemy (army); udah peng-a. Sadok kami mindah ka menoa tu', after the defeat at Sadok we moved to this part of the country",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Be able, can, could",
        "examples": [
          "enda' a. aku asi' nya', I can't finish that rice",
          "pengawa' nya' a. aku, I can do that work",
          "a. nuan ma' utai tu'? can you carry this?",
          "ni a. kitai ngada ka ia pinang selalu? how can we be always supplying her with areca nut?",
          "ia nyampi a. datai ngagai kayu' tinggi' nyentok ka langit, he repeated the invocation and got as far as the tree so tall as to reach the sky"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "alai",
    "meanings": [
      {
        "definition": "(esp. in Saribas) (a) place, room, situation (where, in which), ENDUR, PAM",
        "examples": [
          "nadai a. agi' di bangkong ia, there is no more room in his boat",
          "aku enda' nemu a. ia, l don't know where he is",
          "menoa baru enda' kala' a. orang pegi, a new land where no one has ever been",
          "nya' tau' a. bemain, that is where you can go for your sport",
          "dini a. nuan nyimpan capak? where do you put the plates?",
          "rumah ti' a. ia diau, the house in which he lives"
        ],
        "synonyms": [
          "(b) occasion, when, MA 1 A",
          "dia' a. aku bisi' hari, when 1 have time; barang maia a. nuan lantang, whenever you are free; hart selalu manah, tang enda' nyamai a. belayar, the weather is set fair but not suitable for sailing; nuan enda' umbas a. ngengkah-ka jari, you're not big enough for me to fight; dua liari lepas nya' a. ia pulai, two days later he went back; baru dudok aku a. ia datai, I had just sat down when he arrived; apin sempat muat gari' kami a. hari ujan, before we had time to get our clothes in it began to rain; nadai a. gawa' laban hari ujan, we can't work because it's raining; kami enda' lama' agi' a. gawa', we shall soon be at work; enda' berasai a. hari malam, it was dark before I realized it",
          "(c) nya' a., therefore, so, nya' kabualr. lembut endar tulang ia, nya' a. ia enda' tau' bejalai, he is so weak he cannot walk",
          "(d) as a connecting phrase",
          "nya' a., pulai ngagai jako' pejalai nuan tadi', well now, coming back to the subject of your journey",
          "(e) reason, why, tegal; kabuah a., kati a., the reason why; lalu ia nusoi kabuah a. ia malu' terantang begau, then he explained why he had sounded the alarm; kati a. nuan enggai enda' pulai pagila'? why do you insist on going home tomorrow?"
        ]
      },
      {
        "definition": "Therefore, then, denoting command or entreaty",
        "examples": [
          "bejalai a.! go then! walk on!",
          "a. meh! be off!, a. bejalai nuan, please go then"
        ],
        "synonyms": []
      },
      {
        "definition": "(of a design) Having awkward spaces",
        "examples": [
          "buali pua' nya' a., the pattern of that cloth is unsatisfactory"
        ],
        "synonyms": []
      },
      {
        "definition": "Trunk of an elephant (?)",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Danau A., river in the land of the dead",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "alak",
    "meanings": [
      {
        "definition": "Mulong a., garden flower Canna sp",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "alam",
    "meanings": [
      {
        "definition": "In, into, inside, dalam",
        "examples": [
          "ia a. sarah, it's in the box",
          "nya' bisi' a. bilik, there is some in the room",
          "ka alam ai', ka'aku, I'll take you on in a diving contest (SELAM) (lit., I'll get into the water)"
        ],
        "synonyms": [
          "taun siti' a. nyin, some years ago, the year before last; runding ati aku a. nyin utai nya' salah, in my heart of hearts I know it is wrong"
        ]
      }
    ]
  },
  {
    "word": "alan",
    "meanings": [
      {
        "definition": "Resting or starting place, palan",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Point in time, average, usual, normal",
        "examples": [
          "tu' a. maia kami badu' gawa', this is our (usual) time for stopping work",
          "ia belanda' endang a. peneras orang, he runs as fast as most people"
        ],
        "synonyms": []
      },
      {
        "definition": "Tree Shorea albida Sym., (in 2 nd Div.) empenit",
        "examples": [
          "gen. SELANGAN"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "alang",
    "meanings": [
      {
        "definition": "(M.) Beam",
        "examples": [
          "a. para' nya' bentur, the beams of the rack are bent"
        ],
        "synonyms": []
      },
      {
        "definition": "(M.) A.-a., insufficient, (do) half-heartedly, mekang",
        "examples": [
          "a.-a. pemakai, not enough food",
          "a.-a. jako' ia leboh bicara, when his case was heard he said little",
          "a.-a. aku bekereja, I do my work after a fashion (or, without finishing anything)"
        ],
        "synonyms": [
          "tulis aku agi' a.-a., I haven't quite finished writing"
        ]
      },
      {
        "definition": "Man's name",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "alap",
    "meanings": [
      {
        "definition": "Condition, state, fate",
        "examples": [
          "a. utai nya' udah badas di-gaga' orang, di-bali' nuan baru nyau jai', the thing was put into good order by others but as soon as you touch it you spoil it"
        ],
        "synonyms": []
      },
      {
        "definition": "Ngalap, slow down (to recover breath); kami ngalap, we slowed down",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "A spirit",
        "examples": [
          "Antu A. indai Anggat, the spirit Alap mother of Anggat"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "alar",
    "meanings": [
      {
        "definition": "Sickness esp. of filariasis in which there is fever and sometimes delirium recurring for several days accompanied by swelling of the legs (UNTUT)",
        "examples": [
          "a. ia udu bendar, his a. is very bad",
          "kaki ia a., his legs are swollen",
          "a. ia tus, the swelling has gone down"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "alas",
    "meanings": [
      {
        "definition": "(M., used in Bible for) Foundation",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Kind of jar (tajau) valued (H., 1900) between$ 5 and$ 10, (in tunggu 'fines') equal in value to 2 ponding jars of half a rasa'jar",
        "examples": [
          "a. ngerang, kind of a. jar"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "alau",
    "meanings": [
      {
        "definition": "Buntak a., insect pest of padi, unid",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Exclamation of assent or surprise, to call attention or emphasize imperative",
        "examples": [
          "a.! look here! (or) come on!",
          "a. meh! I will!",
          "a. uji! come and try!",
          "a. bejako! come and talk it over!",
          "a.! palu' ular nya'! go on! hit that snake!",
          "ia selalu be-a.-a. enda' ngasoh aku, he is always warning me not to"
        ],
        "synonyms": []
      },
      {
        "definition": "A.-a., railing or support",
        "examples": [
          "tanju' ia di-gaga'-ka a.-a., he made a railing to his veranda",
          "ia nyau-ka a.-a. aku bejalai, he became my support when 1 walked"
        ],
        "synonyms": [
          "LALAU"
        ]
      }
    ]
  },
  {
    "word": "ali",
    "meanings": [
      {
        "definition": "(M.) Man's name",
        "examples": [
          "an A bang A. was well-known about 1900 when he was in charge of Kapit"
        ],
        "synonyms": []
      },
      {
        "definition": "A.-a., apart, ka diri'",
        "examples": [
          "aku dudok a.-a. ari sida', I sit apart from them"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ali'",
    "meanings": [
      {
        "definition": "Buku' a., ankle",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "alih",
    "meanings": [
      {
        "definition": "(M.) Move, shift, turn over (KALIH)",
        "examples": [
          "aku ka' ngalih-ka padong aku, I'm going to move my bedstead",
          "aku ngalih-ka diri', I turned over",
          "ia ngalih-ka ikan tunu', she turns the fish (that is) roasting",
          "hari nyau ngalih, it is past noon"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "alik",
    "meanings": [
      {
        "definition": "A.-a., metal buckle or clasp, lalik",
        "examples": [
          "tu' a.-a. sarong duku' aku, this is the buckle of my scabbard"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "alir",
    "meanings": [
      {
        "definition": "(M., 'flow') Large 'hook' used in catching crocodiles (BAYA), catch crocodiles with this, sempekang",
        "examples": [
          "suah ia ngalir jagu' ti' makai anak mensia, he is often out to catch crocodiles that eat men",
          "a. ia enda' kala' enda' bulih, his hook never misses",
          "(jocularly) aku ngalir menyadi' aku ti' tindok, I woke my younger brother suddenly (lit., 'hooked' him). An a. is a sharp stake (or two crossed stakes) baited with a tethered live dog and attached to a long line (aran), the other end of which is free. When the crocodile takes the dog the stake lodges",
          "the free line shows his position and is used to haul him in"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "alit",
    "meanings": [
      {
        "definition": "Stop up, block, interdict",
        "examples": [
          "lubang nya' a., that hole is blocked",
          "ia ngalit-ka lubang, he stopped up the hole",
          "Perintah ngalit-ka jalai, Government interdicts the road (or, blocks a loophole)",
          "a. burit, a. lubang, grasses (rumput), unid"
        ],
        "synonyms": []
      },
      {
        "definition": "Puzzled, dumbfounded",
        "examples": [
          "a. aku ngereja nya'. I'm puzzled (as to how) to do that",
          "ia a. hati meda' utai nya', he was dumbfounded at seeing that"
        ],
        "synonyms": []
      },
      {
        "definition": "Stream name",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "alkudus",
    "meanings": [
      {
        "definition": "(Ar., 'the holy') Boh A., Holy Ghost",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "Allah Taala",
    "meanings": [
      {
        "definition": "(Ar., 'God Most High') (Christian) God",
        "examples": [
          "ENTALA"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "almari",
    "meanings": [
      {
        "definition": "(Hind, from Port, almario) Almirah, cupboard",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "Almesih",
    "meanings": [
      {
        "definition": "(Ar., al-masehi) Christ, Keristus",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "aloh, aloi",
    "meanings": [
      {
        "definition": "Term of address used between men (only intimates), ajuli",
        "examples": [
          "Pa'A., SALI of Panggau"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "alok",
    "meanings": [
      {
        "definition": "Shade, AYONG",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "along",
    "meanings": [
      {
        "definition": "Smuts, soot, lamp-black, AROK",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "alu",
    "meanings": [
      {
        "definition": "Pestle of hard wood used to pound padi, rice, etc., in a lesong",
        "examples": [
          "lubang a., hole in sadau floor above tempuan ruai through which the a. can rise when in use. After a death, an a. is laid across the top of the house steps to prevent the Sebayan entering, to whom it appears as a cobra"
        ],
        "synonyms": []
      },
      {
        "definition": "(fig.) Phallus",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Belaboh a., alternately, in turn",
        "examples": [
          "sida'munsoh nikam sangkoh belaboh a., the enemy threw spears in turn. When two or three women are pounding in the same mortar together the a. rise and fall in turn"
        ],
        "synonyms": []
      },
      {
        "definition": "Ngalu, go shopping",
        "examples": [
          "aku ngalu ka pasar, I am off to the shops",
          "ia nyau ngalu garam, he has gone to barter for salt"
        ],
        "synonyms": []
      },
      {
        "definition": "Ngalu, welcome, receive guests with ceremony, AMBAT",
        "examples": [
          "ia ngalu pengabang enggau manok, he welcomed the guests with a fowl",
          "a. apai nuan pulai nemuai, go and meet your father as he returns from the visit"
        ],
        "synonyms": [
          "hence"
        ]
      },
      {
        "definition": "Ngalu antu, ngalu petara, receive and introduce to the house the heavenly guests at a gawai. The people pass the length of the house several times, led by a dancer, flag, cockerel, offerings, and drink, with the gongs following the people. At Gawai Batu there are more men, but at Nyimpan Padi more women",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "A.-a., marine fish, Barracuda Spliyraena sp",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "alun",
    "meanings": [
      {
        "definition": "(M.) (of sea) Swell, rollers, surge",
        "examples": [
          "a.-a., a. gelumbang, waves or swell"
        ],
        "synonyms": []
      },
      {
        "definition": "Ngalun, overwhelm, roll over, drive back, rush furiously",
        "examples": [
          "sereta gelumbang ngalun bangkong ia lalu karam, the wave overwhelmed his boat and it sank",
          "a. gelumbang ngalun perau' kami ka tebing, the waves drove our boat ashore",
          "a. munsoli balat bendar, the enemy charged furiously",
          "munsoh ngalun-ka kami datai ka sungai, the enemy forced us back to the river",
          "atau aku ngalun, I'm going to be sick (lit., my stomach is heaving)"
        ],
        "synonyms": []
      },
      {
        "definition": "Embanked, bank up",
        "examples": [
          "ia ngalun-ka tanah, he banked up the earth",
          "jalai a., embanked road (e.g. in wet padi or swamp), modern road, high road (jalai raya)"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "alur",
    "meanings": [
      {
        "definition": "(M., 'groove') (Main) current of a river, gentali ai', (hence) the deep channel",
        "examples": [
          "ia merau' nengah a., he goes with tbe current",
          "ngelaban a., go against the current",
          "sepiak tu' mabu', nyin a., it is shallow this side, the channel is over there"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "alus",
    "meanings": [
      {
        "definition": "Smooth, flat",
        "examples": [
          "kulit ia a., his skin is smooth",
          "Wong Padong a. kamari', Padong Waterfall was smooth yesterday (i.e. high flood flattened the fall)",
          "ia ngalus-ka papan, he is smoothing the plank"
        ],
        "synonyms": []
      },
      {
        "definition": "Fine, small",
        "examples": [
          "pengawa' ia a. bendar, his work is very fine",
          "ubong nya' a., that is fine cotton",
          "bala sida'a. magang, their team is made UP of small men"
        ],
        "synonyms": []
      },
      {
        "definition": "Peaceful, calm",
        "examples": [
          "tasik a., a calm sea",
          "menoa a. diatu', the country is at Peace now",
          "uji ngalus-ka laya' sida' nya', try to settle their quarrel"
        ],
        "synonyms": []
      },
      {
        "definition": "(in games) Main ia a., he plays a clean game",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "(of good manners) Jako' ia a., he speaks politely",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "am",
    "meanings": [
      {
        "definition": "Exhortative interjection, (short for) aram",
        "examples": [
          "a.! bejalai kitai! come on! let's go!"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ama",
    "meanings": [
      {
        "definition": "When, whenever, usu. leboh",
        "examples": [
          "a. aku aginsap, batok, whenever I smoke I cough"
        ],
        "synonyms": []
      },
      {
        "definition": "A.... a...., sometimes... sometimes..., kadang",
        "examples": [
          "a. bisi', a. nadai, sometimes it's there, sometimes not"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ama'",
    "meanings": [
      {
        "definition": "(M., ama) Louse found on fowls (and Umansj. There are two kinds",
        "examples": [
          "the black and tbe white"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "amai",
    "meanings": [
      {
        "definition": "(in Balau and Sebuvau) True, very, AMAT",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "amal",
    "meanings": [
      {
        "definition": "(Ar., 'putting in operation') Practices for acquiring strength or beauty",
        "examples": [
          "tu'a. kering, this is the art of acquiring (physical) strength",
          "ia ngamal, he fasts (or performs the proper ceremonies) to become strong"
        ],
        "synonyms": [
          "ISIN"
        ]
      }
    ]
  },
  {
    "word": "amang",
    "meanings": [
      {
        "definition": "Menace, threaten, aim (weapon) at; (hence) test, try",
        "examples": [
          "ari a. jako' ia aku nemu ia deka' nganu' aku, from his threatening tone I knew he was going to take me to task",
          "ia ngamang aku enggau duku', he threatened me with a knife",
          "a. dulu' baru numbok, try first before you pierce it",
          "sida' ngamang aja' lalu ia rari, they only aim and it runs away"
        ],
        "synonyms": [
          "KAMANG; hence"
        ]
      },
      {
        "definition": "Look like being, seem to be; a. meh ngena', it seems about right",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "(wonder, suppose) Perhaps",
        "examples": [
          "pia' a., maybe so"
        ],
        "synonyms": []
      },
      {
        "definition": "(poet.) Poised, ready",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "River near Kapit",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "amat",
    "meanings": [
      {
        "definition": "True, real, certain, authentic",
        "examples": [
          "kati a. anak siduai nya'bagas bejalai? is it true their son is always away from home?",
          "au'! a.! yes! it's true!",
          "a.? really?",
          "a. ia pulai kamari', it's true he came back yesterday",
          "ai' a., plain water",
          "(make good or true, confirm) kamaia ia ka' ngamat-ka semaia ia? when will he fulfil his promise?",
          "aku ka' ngamat-ka jako' aku, I shall carry out what I said",
          "berita di- kamat-ka, the report is confirmed",
          "ukum di- kamat-ka ulih akim, (of an appeal dismissed) the sentence was confirmed by the judge",
          "nadai peng-a. jako' nuan, there's no truth in what you say"
        ],
        "synonyms": []
      },
      {
        "definition": "Indeed, truly, very, really",
        "examples": [
          "a. jako' aku, indeed I said so",
          "bujang nya' kering a., that young man is very strong"
        ],
        "synonyms": []
      },
      {
        "definition": "But, but yet",
        "examples": [
          "ia buta', a. ia nemu nangkal getah, he is blind, but yet he can tap rubber"
        ],
        "synonyms": []
      },
      {
        "definition": "Provided that, if only",
        "examples": [
          "lapa enda', a. ga' nuan bisi' di rumah? why not, provided you are in the house?"
        ],
        "synonyms": []
      },
      {
        "definition": "Buloli a., bamboo, unid",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "amau",
    "meanings": [
      {
        "definition": "Dust, dirt",
        "examples": [
          "beri' ka aku a. semakau nya', give me the dust of that tobacco",
          "kaki ia mai' a. ari tanah, his feet brought dirt (in) from the field",
          "a. bubok, dust made by woodworm or borer beetle"
        ],
        "synonyms": []
      },
      {
        "definition": "Kulat a., bluish edible fungus of recently burned clearings, unid",
        "examples": [
          "indu' kulat a., insect, unid. that frequents the fungus"
        ],
        "synonyms": []
      },
      {
        "definition": "Drag a boat along the shore",
        "examples": [
          "sida' nya' ngamau laban takut-ka gelumbang, they dragged their boat along the shore for fear of the breakers"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "amba'",
    "meanings": [
      {
        "definition": "Running noose, cord noose in trap, snare, trap (petok) using a noose",
        "examples": [
          "a. ia enda' nyintalt, his trap didn't catch anything",
          "sida' suah ngamba' rusa' kami, they are always snaring our deer",
          "kijang siko' ngena' a. aku, a barking deer was caught in my trap"
        ],
        "synonyms": []
      },
      {
        "definition": "Woman's name",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ambai",
    "meanings": [
      {
        "definition": "Lover, sweetheart, pebayu",
        "examples": [
          "a. mati ia, his true love",
          "a. peransang tunang, true love (poet., who persuades to betrothal?)",
          "siduai nya' be-a., those two are lovers"
        ],
        "synonyms": [
          "hence"
        ]
      },
      {
        "definition": "(in Bible, for) Fornication",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Kind of fishing net, AMBEI",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ambal",
    "meanings": [
      {
        "definition": "Razorshell, edible marine shellfish. For other shellfish, LUKAN",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ambang",
    "meanings": [
      {
        "definition": "Shaky, tottering",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Ngambang, surmise, be uncertain (?)",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ambat",
    "meanings": [
      {
        "definition": "Intercept, (hence) stalk prey as a cat does",
        "examples": [
          "a. ari moa pintu nyin, stop (him) from getting through the door there",
          "sida' bepekat ka' ngambat bala ti' mansang, they took counsel to intercept the advancing army"
        ],
        "synonyms": []
      },
      {
        "definition": "(M.) Block, surround to catch, per-a",
        "examples": [
          "jalai ia ambis di-a. kami, all his ways (of escape) are blocked by us"
        ],
        "synonyms": []
      },
      {
        "definition": "Go to meet",
        "examples": [
          "kamiundur ngambat Tuan Raja ka Lingga, we are going down to meet the Rajah at Lingga"
        ],
        "synonyms": [
          "ALU"
        ]
      },
      {
        "definition": "A. aku, lend me a hand (i.e., to hold steady)",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ambau",
    "meanings": [
      {
        "definition": "Rise up, start",
        "examples": [
          "ia a. bejalai, he rises up to walk"
        ],
        "synonyms": []
      },
      {
        "definition": "Man's name",
        "examples": [
          "leader of 17 generations ago (16 th c.?) descendant of Merom Panggai, and great-grandfather to TINDIN, who led a migration from Merakai into the Kumpang"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ambei",
    "meanings": [
      {
        "definition": "(M.) Triangular dip-net fixed to crossed poles to hold the fore-edge taut, ambai",
        "examples": [
          "(a) used from a drifting boat, (b) set vertically on land to catch small birds. ENGGIAN, SELAMBAU, TANGGOK"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ambi'",
    "meanings": [
      {
        "definition": "Take, fetch, get, carry",
        "examples": [
          "ia ngambi' sumpit, he carried a blowpipe",
          "ia ngambi' manang, he fetched the manang-, a. wang tu', take this money",
          "sida' nurun ngambi' indu' siko' mai' ka rumah (sida'), they went and took a girl and brought her to their house",
          "aku ngambi' ia nemuai, I invited him to stay with me",
          "hist' ga' ngambi' dua-tiga iti', there are, say, two or three"
        ],
        "synonyms": []
      },
      {
        "definition": "(pe-a.) Pambi'-ka, subtract it; sam pambi', subtraction sum",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Ngambi'-ka, so that, in order that, awak-ka",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "(short for sambi') Friend, akih, unggal",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ambih",
    "meanings": [
      {
        "definition": "Finished, ABIS, ambis",
        "examples": [
          "ber-a., all together",
          "ber-a. ngirup, drink together (e.g., a toast or at a party)"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ambin",
    "meanings": [
      {
        "definition": "(M., strap or loop for carrying) Large wide basket with strap (s) for carrying padi, etc.; cf. lanji'",
        "examples": [
          "penoh a. padi ulih ia, he got a basket full of padi"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ambis",
    "meanings": [
      {
        "definition": "Finished, ABIS, ambih",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "amboh",
    "meanings": [
      {
        "definition": "1 Muddy, soft mud",
        "examples": [
          "tebing at' nya' a. bendar, enda' tau' endur bejalai, the banks of that stream are so soft that you cannot walk on them",
          "ai' a., downriver stream with soft mud banks"
        ],
        "synonyms": []
      },
      {
        "definition": "Scum, slime",
        "examples": [
          "sungai tu' enda' ulih alai nyala laban a., you can't use a cast-net on this river because of the scum",
          "anang ngirup ai' a., don't drink cloudy water"
        ],
        "synonyms": [
          "AMUR"
        ]
      },
      {
        "definition": "Forge metal, (soften?), usu. KAMBOH",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ambok",
    "meanings": [
      {
        "definition": "(M., kera') Long-tailed or Crab-eating Macaque Macacus fascicularis fascicularis Raffles",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ambol",
    "meanings": [
      {
        "definition": "For AMBUL, light; float",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ambong",
    "meanings": [
      {
        "definition": "(M., sombong) Proud, haughty",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "(M.) Rough basket of cane or bamboo for carrying fruit, etc., or storing crockery; aku meli buah lensat sa-a. besai, I bought a big basket of lensat fruit; a. capak, stack or store of plates",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ambu'",
    "meanings": [
      {
        "definition": "Claim, lay claim to, acknowledge, choose",
        "examples": [
          "a. aku di-rebut ia, he made off with what I had claimed",
          "babas tu' a. aku, this is the land I claim",
          "sida' suali ngambu' memudai orang, they often lay claim to land belonging to other people",
          "a. menoa Pilipin ngagai menoa Sabah, the Philippines' claim against Sabah"
        ],
        "synonyms": []
      },
      {
        "definition": "Ngambu' (apai), (for an unmarried woman) claim or cite a man as the father of her unborn child. If a woman claims a man as the father but will not marry him, he being willing, she incurs a fine",
        "examples": [
          "if her claim fails or she refuses to claim she is fined more heavily, and must also provide pelasi' menoa for fear the preg-nancy is the result of incest (mali)"
        ],
        "synonyms": []
      },
      {
        "definition": "Food taken between meals",
        "examples": [
          "tu' a. anak aku, this is just a snack for my child"
        ],
        "synonyms": []
      },
      {
        "definition": "Term of endearment",
        "examples": [
          "ucu' a., grandchildren, the 'little ones', descendants"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ambul",
    "meanings": [
      {
        "definition": "Light (as cotton, feathers, cork)",
        "examples": [
          "hence"
        ],
        "synonyms": []
      },
      {
        "definition": "Float attached to fishing net; cf. kelampong",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Man's name",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ambun",
    "meanings": [
      {
        "definition": "(M.) Dew, damp, embun, jemu'",
        "examples": [
          "ia datai tumu, agi' bisi' a., he came early (when) the dew was still (lying)",
          "pagi tu' be-a., it is misty this morning",
          "sa-hari tu' balat endar a., it is very foggy today",
          "a. bunsa', thin mist"
        ],
        "synonyms": [
          "per-a, expose to dew"
        ]
      },
      {
        "definition": "(poet.) Souls of the Dead (sebayan) in the form by which they help padi to grow",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Tree Casuarina sumatrana Miq",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ambur",
    "meanings": [
      {
        "definition": "(M., hambur) Scatter, sprinkle, tabur; cf. abur",
        "examples": [
          "aku ngambur-ka berau ka' empa' manok, I scattered rice for the chickens"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "Amerika",
    "meanings": [
      {
        "definition": "United States of America, American, Merika, Merikan",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ami'",
    "meanings": [
      {
        "definition": "Wet, soft, muddy",
        "examples": [
          "tengah laman ia a., the ground in front of his house is muddy",
          "ia ngunsa' ai' ngami'-ka jalai, he sprinkles water on the ground to lay the dust (lit., to muddy it)"
        ],
        "synonyms": []
      },
      {
        "definition": "Fertile, loamy, moist",
        "examples": [
          "tanah ia a., his land is rich",
          "ia ngami'-ka kebun ia enggau tai' capi, he manured his plantation with cow-dung",
          "balat peng-a. tanah nya', that land is very fertile"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "amok",
    "meanings": [
      {
        "definition": "(M.) Attack, 'run amuck'",
        "examples": [
          "a. munsoh balat endar, the enemy's attack was furious",
          "aku meda' orang ti' ngamok di pasar, I saw the man who ran amuck in the bazaar",
          "siduai ia be-a., (often of children) they were fighting"
        ],
        "synonyms": []
      },
      {
        "definition": "Passion, enthusiasm, do with keenness, slave away at",
        "examples": [
          "ia ngamok bumai taun tu', he did a great deal of farming this year (went at it hard)",
          "a. ia, he has a passion for it",
          "mensia be-a. -ka gari' diatu', people are rushing to get clothes now"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ampa'",
    "meanings": [
      {
        "definition": "(M., hampa) Worthless, empty, rubbish, husk, chaff",
        "examples": [
          "a. magang padi nya', that padi is all empty husks",
          "padi fa be-a., there are many empty ears in his padi",
          "jako' a., vain talk",
          "ia a. kami, he's the worst of us",
          "nuan tu' a. orang, you are good for nothing",
          "jako' ia maioh a., there's nothing in what he says",
          "nganti' ai' ngampoh-ka umai kitai nganyut-ka a., wait until the water floods the padi field and sends the rubbish adrift"
        ],
        "synonyms": [
          "ABOK, SEKU'"
        ]
      },
      {
        "definition": "A. Jawa', KEMPING PADI, brother of Keling",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ampai",
    "meanings": [
      {
        "definition": "(M. 'hang and sway') Any cloth worn on the shoulder, shawl, stole, scarf; wear cloth in this way; cf. lempai (drape)",
        "examples": [
          "AWI"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ampalebang",
    "meanings": [
      {
        "definition": "(H. only) The greatest liar",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ampan",
    "meanings": [
      {
        "definition": "Marik a., long bead necklaces, per-a",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ampang",
    "meanings": [
      {
        "definition": "(usu.) Anak a., bastard, child with no known or recognized father",
        "examples": [
          "ia anak a., he is illegitimate",
          "ia udah ngampang-ka indu', he caused a woman to have an illegitimate child",
          "ia ngampang, she gave birth to a bastard"
        ],
        "synonyms": []
      },
      {
        "definition": "Valueless, 'black sheep'",
        "examples": [
          "ia nya' a. kami Undup, he is the worst of us Undups",
          "ia ngampang kia'-kia', he is a vagrant"
        ],
        "synonyms": []
      },
      {
        "definition": "A. belantan, a. belulai, names of cloths (PUA')",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ampar",
    "meanings": [
      {
        "definition": "(M., hampar) Spread",
        "examples": [
          "ia ngampar kain atas mija, she put a cloth on the table"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ampat",
    "meanings": [
      {
        "definition": "(M.) Four, empal",
        "examples": [
          "kempat (ke-a.), fourth",
          "hari a., Thursday",
          "bulan a., April"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ampau",
    "meanings": [
      {
        "definition": "ANG-PAU, gift, present",
        "examples": [
          "ia ngampau aku leboh aku nikali, he gave me a wedding present"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ampih",
    "meanings": [
      {
        "definition": "Near, close, dampih",
        "examples": [
          "ia dudok a. aku, he sat close to me",
          "anang ngampih aku, don't come near me"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ampik",
    "meanings": [
      {
        "definition": "Mud or dirt on the body",
        "examples": [
          "nuan tu' bau a., you smell foul"
        ],
        "synonyms": [
          "AMPIS"
        ]
      }
    ]
  },
  {
    "word": "ampin",
    "meanings": [
      {
        "definition": "(M.) Baby's napkin, 'nappy'",
        "examples": [
          "ia malut anak enggau a., she put a napkin on the child"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ampir",
    "meanings": [
      {
        "definition": "(M., hampir) Encroach, come foraging",
        "examples": [
          "ia ngampir temuda aku, he encroached on my fallow land",
          "umai kami di-a. nemalam, our farm was raided (by animals) last night"
        ],
        "synonyms": []
      },
      {
        "definition": "Approach threateningly or suspiciously",
        "examples": [
          "a. ia enggau terabai, approach him with a shield",
          "ia mansang ngampir-ka munsoh, he goes to approach the enemy",
          "perau' orang mata bekayoh ngampir kami, the police boat paddled up to us"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ampis",
    "meanings": [
      {
        "definition": "Bau a., smell of the body",
        "examples": [
          "ia bau a., he smells"
        ],
        "synonyms": [
          "AMPIK"
        ]
      }
    ]
  },
  {
    "word": "ampit",
    "meanings": [
      {
        "definition": "Share, have or get a share or division, 'fair shares'",
        "examples": [
          "aku enda' a. lauk, I have no meat",
          "Apai Aloi berunding ka' makai ambis lalu enda' ngampit bini anak ia, Apai Aloi thought to eat it all himself and not give his wife and son a share"
        ],
        "synonyms": [
          "BAGI, UNGKUP"
        ]
      },
      {
        "definition": "Learn, hear, be informed of",
        "examples": [
          "aku enda' a. berita nya', I hadn't heard that",
          "anang enda' ngampit-ka aku enti' nuan bebini, don't fail to let me know if you get married"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ampoh",
    "meanings": [
      {
        "definition": "(Minangkabau M.) Flood, submerge",
        "examples": [
          "a. ai', flooded",
          "ai' a., floodwater",
          "kayu' nya' a., that log is covered",
          "a. patong, (the water is) above my knee",
          "laban pemaroh ia menoa nya' selalu a. bah, because it is low-lying that area is always being Hooded",
          "sangkoh ia a. ba babi, his spear was buried in the pig",
          "ai' ngampoh-ka jalai, water covers the road"
        ],
        "synonyms": []
      },
      {
        "definition": "Afloat, float",
        "examples": [
          "nganti' perau' a., wait till the boat is afloat",
          "ai' ngampoh-ka perau', the water (rises and) floats the boat"
        ],
        "synonyms": []
      },
      {
        "definition": "Kulat a. bah, edible fungus, unid",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ampul",
    "meanings": [
      {
        "definition": "Soft, light, flabby, not lasting",
        "examples": [
          "tuboh ia a., he is flabby",
          "kayu' a., softwood",
          "anang ngampul-ka buah ia, don't make that fruit soft",
          "peng-a., softness, flabbiness"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ampun",
    "meanings": [
      {
        "definition": "(M.) Forgiveness, pardon, submission",
        "examples": [
          "ia udah ngampun penyalah aku, he has forgiven my fault",
          "ia minta'a. aku, he asked my pardon"
        ],
        "synonyms": []
      },
      {
        "definition": "Apologize, confess",
        "examples": [
          "aku ngampun penyalah, I confess the fault",
          "aku ngampun ngagai nuan laban aku encuri buah nuan, I ask your forgive-ness for having taken your fruit"
        ],
        "synonyms": []
      },
      {
        "definition": "Langkau a., shrine made at NGAMPUN rite",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "amput",
    "meanings": [
      {
        "definition": "Sting",
        "examples": [
          "a. gamang bisa bendar, a hornet's sting is very painful",
          "singut ngamput pending ia, a bee stung him on the ear"
        ],
        "synonyms": [
          "the sting as part of an insect is butoh"
        ]
      },
      {
        "definition": "(M.) (coarse) Copulate, be-a.\\ PURIH",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "amu'",
    "meanings": [
      {
        "definition": "Greedy, covetous",
        "examples": [
          "anang ngamu' nya', don't be so greedy"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "amun",
    "meanings": [
      {
        "definition": "Concealment, conceal, usu. lalai",
        "examples": [
          "ia ngamun-ka penyalah ia, he conceals his fault"
        ],
        "synonyms": [
          "LAMUN"
        ]
      }
    ]
  },
  {
    "word": "amur",
    "meanings": [
      {
        "definition": "Mud, dust, muddy, cloudy (kamur, Pamur)",
        "examples": [
          "ia napis a. (ba) ai', she strains the airt from the water",
          "tuboh sida' anembiak arnbis a. udah mandi' ai' keroh, those children are mud all over from bathing in muddy water",
          "ai' alam gelas aku a.-a., the water in my glass is cloudy",
          "hari nyau a., the day has gone dull",
          "papan be-a.-a., the floor is dusty"
        ],
        "synonyms": [
          "AMBOH"
        ]
      }
    ]
  },
  {
    "word": "amus",
    "meanings": [
      {
        "definition": "Very small red ant (semut), unid",
        "examples": [
          "kayu' nya' be-a., there are a. ants in that tree"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "anak",
    "meanings": [
      {
        "definition": "(M.) Child, son, daughter, offspring, youngster, junior",
        "examples": [
          "ia nganak (or menganak) -ka aku, she calls me son",
          "ber-a., give birth (ADA)"
        ],
        "synonyms": [
          "ia ber-a. lelaki, she bore a son; (wang) ber-a., (of money) bear interest, ia ber-a. -ka duit, he put some money out at interest; ber-a.-a., all the family; kain nya' udah ber-a., that cloth has frayed; sida' meny-a., they and their children; per-a., offspring, issue; per-a. nengeri, citizen by birth. A. ambu', adopted child; a. ampang, bastard; a. bansa, naturalized citizen; a. ba. ru, issue of a more recent marriage; a. biak (or anembiak), young child, children, 'kids', followers, other ranks, subjects; Council A. -biak Sarawak, Sarawak Youth Council; a. -biak redak, people of no account, small fry, the common herd; Pengintu A. -biak Redak, Social Welfare; a. bini, wife and family; a. buah, relation; a. bujang, young bachelor (boy in early teens); a. bunsu, youngest child; a. dagang, trader; a. dara, virgin, 'lass', 'young lady', (cf. a. bujang) -, a. empi', latest born (of all animals, distinct from a. bunsu) -, a. duit, interest on money; a. engka, only child, a. tunggal-, a. Iban, the Iban; (a.) icit, great-grandchild; a. inang, foster child; a. indu', girl, daughter; a. iru, adopted child; a. itik, chick, chicken; a. jelu, animal (as opp. to man); a. kampar, forest produce hunter, wandering labourer; Opis A. -kuli, Labour Office (Depart-ment); a. lama', issue by a former marriage; a. laki, a. lelaki, boy, son; a. lulus, still-born child; a. manang, child who has been treated by the saut ritual; a. mensia, human being (as opp. to a. jelu), the Son of Man (in the Bible); a. menyadi', nephew, niece; a. mit, little child, baby; a. orang, another person's child; a. patu, orphan (with neither parent); (a.) pejagang, great-great-great-grandchild, (?'crawler'); a. pengkuan, last-born child (cf. a. empi') -, a. raja, freeborn person (as opp. to slave); a. sapit, twins; a. sekula, schoolboy or -girl; a. tiri', stepchild; a. tuai, eldest child, heir; a. tunggal, only child, a. engka-, a. ucu', grandchild, descendant; a. udok (or ukui), puppy; a. ulat, baby girl; a. umang, fatherless (cf. a. patu) -, a. umboh, as a. icit, pejagang; a. umbong, child kept secluded; a. uting, sucking pig; (a.) wit, great-great-grandchild. PURIH"
        ]
      },
      {
        "definition": "Small, a little, young",
        "examples": [
          "a., piece in the game main macan",
          "a., smallest in a set of bamboo pipes (kerurai)",
          "a. best a. garam, a bit of iron and a little salt",
          "a. hah, quadrate lobe of liver (atau)",
          "a. impun, very small fish, tiddler",
          "a. kayu', tree seedling, sapling",
          "a. mata, pupil of the eye",
          "a mulong, sago sucker",
          "a. pasang, beginning of flood tide, half or intermediate tide, small tidal effect far upriver in dry weather",
          "a. (or sumbok) pisang, banana sucker, young banana plant",
          "a. remaung, expression used by or of a person boasting",
          "a. sungai, brook, rill",
          "a. tunjing, toe (of animal)",
          "a. wong, small rapid in a series",
          "ikan a., small fish, fish fry",
          "jelu a., small game, any animal smaller than pig or deer",
          "tunjok a., little finger"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "anam (Minangkabau M.) Six, 6, NAM",
    "meanings": [
      {
        "definition": "",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "anang",
    "meanings": [
      {
        "definition": "Do not",
        "examples": [
          "(a) a. jalai dia', don't walk there",
          "a. udu, don't be too (rough, hasty, etc.)",
          "a. baka pendiau jelu, don't behave like a beast",
          "a. guai dulu', wait a bit, don't be in a hurry",
          "a. di-asoh ia, don't let yourself be ordered about by him",
          "a. sa-a., (emphatic) don't on any account",
          "(b) (in prohibitions"
        ],
        "synonyms": [
          "cf. enda' tau*) a. di-tengah, no entry, no thoroughfare; a. enda' nemuai, you must come again, don't fail to visit (us)"
        ]
      },
      {
        "definition": "Laban ujan deli nuan celap, a. agi' seleju', if you're cold in the rain, how much colder you'd be in snow; aku nadai hari nemuai ngagai ia, a. telah (or sebut) agi' diau sa-minggu, I haven't time to visit him, far less spend a week with him; a. ka ringgit aku bisi', sa-sen deli nadai, I haven't a cent, let alone a dollar",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "anau",
    "meanings": [
      {
        "definition": "(Minangkabau M., Br.) Palm Arenga sp., aping, ijok",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Rantaa A., a reach in the river Panggau near the abode of JALI'",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ancau",
    "meanings": [
      {
        "definition": "Spread, stretch out",
        "examples": [
          "ia agi' ngancau tikai di ruai, he is still spreading mats in the ruai, emperan ngancau ari tebing ai' ngagai kaki bukit nyin, the lowland stretches from the river bank to the foot of those hills",
          "ia be-a. tikai, she spreads a mat",
          "hari ngancau, the day when all but the last minute things (like spreading mats) are ready for agauiai (festival) and the gathering of guests is due on the morrow",
          "(fig.) ia selalu di-per"
        ],
        "synonyms": [
          "a. -ka orang, he is always getting into trouble (Pbeing put upon)"
        ]
      }
    ]
  },
  {
    "word": "anci'-anci'",
    "meanings": [
      {
        "definition": "(always with negative ukai or enda') Superlative, excessive, beyond measure, beyond all reason",
        "examples": [
          "pemerat mas ukai a.-a., the weight of the gold is altogether too much",
          "ukai a.-a. pemanah gamal ia agi' menya', she was extremely beautiful once"
        ],
        "synonyms": [
          "CECAMANG"
        ]
      }
    ]
  },
  {
    "word": "ancin",
    "meanings": [
      {
        "definition": "Rotten, buntu', busok",
        "examples": [
          "ikan nya' nyau a., that fish is rotten",
          "nadai utai ngancin ia, it's as rotten as can be",
          "orang a., a wastrel"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ancit",
    "meanings": [
      {
        "definition": "Send flying, shoot out like a shot, be hasty",
        "examples": [
          "pangka' aku a., my top was sent flying",
          "ia a. di-buai kuda, he was thrown from the horse",
          "aku a. ka menoa bukai, I have gone (shot off) to another land",
          "ia ngancit-ka buah guli aku, he knocked my marble away",
          "ia tau' ngancit-ka leka padi, he can make the rice shoot out of its husk"
        ],
        "synonyms": [
          "TEMPALONG"
        ]
      }
    ]
  },
  {
    "word": "ancong",
    "meanings": [
      {
        "definition": "Puyang a., an ancestor spirit created by PETARA. '",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ancum",
    "meanings": [
      {
        "definition": "Thread",
        "examples": [
          "ngancum-ka jarum, thread a needle"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ancur",
    "meanings": [
      {
        "definition": "(M., Iiancur) Melt, dissolve, disperse",
        "examples": [
          "gula a., the sugar has dissolved",
          "a. lilin nya', melt that wax",
          "ia ngancur-ka cat, he thins the paint",
          "bala ia undur lalu a., his army fell back and dispersed"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "anda",
    "meanings": [
      {
        "definition": "Always lucky, prosperous",
        "examples": [
          "ia a. bumai, he always gets good harvests",
          "Jarit a. bulih ikan, Jarit is successful in fishing"
        ],
        "synonyms": [
          "TUAH"
        ]
      },
      {
        "definition": "Ini' A., one of the deities (PETARA)",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "A. MARA, deity of wealth and material success",
        "examples": [
          "A. Mara Raja Pengibai, A. Mara the Lord of Buyers (i.e., getters of property)"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "andai",
    "meanings": [
      {
        "definition": "Dependent on another, provide for, work for, anyik",
        "examples": [
          "a. apai nuan, provide for your father",
          "a. ia enda' betuku, the work he does (for his people) doesn't amount to anything",
          "Minggat a., Minggat has to be supported",
          "Intai ngandai apai ia, Intai maintains his father",
          "Intai peng-a. apai ia, it is Intai who supports his father",
          "rumah peng-a. Cheshire, a Cheshire Home"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "andak",
    "meanings": [
      {
        "definition": "Attack, assault, fight by advancing and retiring as Iban do, be-a.-a",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "andal",
    "meanings": [
      {
        "definition": "Glad, happy",
        "examples": [
          "semua anembiak ia a. meda', all his followers rejoiced to see it",
          "aku a. meda' nuan bulih padi, I'm glad to see you have got (a good crop of) padi",
          "peng-a., joy"
        ],
        "synonyms": []
      },
      {
        "definition": "(M.) Trust, have confidence in, rely on",
        "examples": [
          "aku a. -ka nuan, I trust you",
          "fa a. -ka aku ngereja pengawa', he relies on me to do the work",
          "pengawa' ia ngandal-ka hati aku, I have confi-dence in his work",
          "anang semina ngandal-ka hati aku, don't lead me on, don't let me down",
          "tu' orang ti' di-kandal-ka aku gawa', this is the man to whom I entrust the work"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "andan",
    "meanings": [
      {
        "definition": "(M., 'unnaturally white') (Pantan) Ini' A., Ini' Manang, wife to Aki' Ungkok, deity of the moon (bulan)",
        "examples": [
          "Ini' A. ke tugang buloh laung, Grandmother A. with coloured streaks like a laung bamboo (moon's corona?)",
          "Ini' A. nepan di perugan remang bejagang, Ini' A. who rides the billowing jostling clouds"
        ],
        "synonyms": [
          "PETARA"
        ]
      }
    ]
  },
  {
    "word": "andang",
    "meanings": [
      {
        "definition": "Work evil, bring misfortune",
        "examples": [
          "semua ambun orang tau' TEPANG, tau' a., nya' buai kesai, all the dead whose spirits can curse and work evil spells be cast away (in sampi at nunu lilin rite)"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "andau",
    "meanings": [
      {
        "definition": "Bridge",
        "examples": [
          "tuan ngasoh orang ngandau sungai mit semua, the officer ordered bridges to be made over all the small streams (i.e., in place of war service or tax (asil))",
          "ngandau Limban, (in manang rites) make a bridge over the Limban"
        ],
        "synonyms": []
      },
      {
        "definition": "Rise late, lie abed (from lazi-ness)",
        "examples": [
          "iga' di' bangat buntau tindok ngandau? why are you so sleepy and lie abed so late? (in sabak, addressing the deceased)"
        ],
        "synonyms": []
      },
      {
        "definition": "Apai a., star, B 1 NTANG",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "andi",
    "meanings": [
      {
        "definition": "Rumour, rita (or berita) ngapa', (or angin)",
        "examples": [
          "be-a.-a., be rumoured abroad, talked about beforehand"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "andin",
    "meanings": [
      {
        "definition": "Burong a., pattern in weaving ('lizard' with 2 heads and no legs?)",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Man's name",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ando'",
    "meanings": [
      {
        "definition": "For ENDU 5, term of address for girls, andoh. (M., 'support in a sling') Make a boat fast (ganding) to a log and drift downstream (atong), carry slung from a pole on the shoulder (as the Chinese do), ngandoh",
        "examples": [
          "ANGGU'"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "andok",
    "meanings": [
      {
        "definition": "Debt free of interest, borrow (usu. padi) without interest",
        "examples": [
          "a. padi ia, borrow his padi",
          "tu' a. ukai UTANG, this is a loan without interest, not a debt (bearing interest)"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "andong",
    "meanings": [
      {
        "definition": "(M., candong) Short heavy knife (DUKU')",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "andu",
    "meanings": [
      {
        "definition": "Creeper with edible fruit, unid",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "andu'",
    "meanings": [
      {
        "definition": "Necklace",
        "examples": [
          "ia be-a., she wears a necklace"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "anembiak",
    "meanings": [
      {
        "definition": "Youth, child, children, follower, followers, nembiak, (a common form of) ANAK-biak",
        "examples": [
          "Pengulu ngasoh a. ia nyukul karni, the chief sent (some of) his people to turn us back",
          "ia penaroh wang a. sekula, he looks after the schoolboys' money",
          "pengintu a. redak, welfare",
          "a. redak, ordinary citizens, small fry",
          "Council A. Sarawak, Sarawak Youth Council"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "anga",
    "meanings": [
      {
        "definition": "Appetite, lust, keran ka'",
        "examples": [
          "ia a. -ka asi', he has a (good) appetite for rice"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "angai",
    "meanings": [
      {
        "definition": "Rantau A., reach in the Panggau near the abode of JALI'",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Kuju'-a., Heron Ardca sp",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "angang",
    "meanings": [
      {
        "definition": "Splayed; EMPEKANG",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "angat",
    "meanings": [
      {
        "definition": "(M.) Hot, feverish, angry, heat",
        "examples": [
          "asi' agi' a., the cooked rice is still hot",
          "a. sa-a., hotter and hotter",
          "anak aku a. di malam, my child was feverish last night",
          "jako' ia ngasoh hati aku a., his speech made me angry",
          "hari a. bendar sa-hari-tu', it is hot today",
          "a. pending aku ninga jako' nya', I was annoyed at hearing that (lit., my ears were hot)",
          "ia ngangat-ka ai', she heated some water",
          "ia be-a. -ka kaki ia ngagai api, he warms his feet at the fire",
          "dilah aku ber-a. laban cabi, my tongue was burnt by the chilli",
          "per-a. ngagai panas tikai nya', put that mat out in the sun",
          "balat peng-a. hari sa-hari-tu', the heat is very great today",
          "PEDAS, hot to taste",
          "PANAS, hot esp. of weather"
        ],
        "synonyms": []
      },
      {
        "definition": "Untrue, excessive, severe, troubled",
        "examples": [
          "dacin ia a., his scales are untrue",
          "ukum a., severe or excessive sentence",
          "rumah a., infected house, i.e., visited (and so troubled) by evil omen (e.g., snake, certain birds, or a deer walking under) or epidemic apparent or real. Opp. of CELAP"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "angau",
    "meanings": [
      {
        "definition": "Watery (in cooking), cook with too much water",
        "examples": [
          "a. engkayu' nya', that vegetable has too much water with it",
          "anang ngangau-ka tubu' nya', don't put too much water with those bamboo shoots"
        ],
        "synonyms": [
          "ANYIR"
        ]
      }
    ]
  },
  {
    "word": "anggam",
    "meanings": [
      {
        "definition": "Claws of a bear (jugam)",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "anggap",
    "meanings": [
      {
        "definition": "Reckon, calculate, think, consider, look ahead, forethought, foresight",
        "examples": [
          "maioh bendar a. hati ia, he has a great deal of fore-sight",
          "ia nganggap-ka utai ti' dudi, he thinks of the consequences",
          "peng-a. bendar nuan tu', you are careful to look before you leap",
          "aku nganggap-ka hari ka' ujan, I reckon it will rain",
          "a. hati aku ia ka' munoh aku, I think he wants to kill me",
          "ber-a., presentation of gifts to guests at end of gawai antu"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "anggar",
    "meanings": [
      {
        "definition": "(M.) Estimate, reckoning",
        "examples": [
          "a. hati aku pukul dua diatu', I reckon it is 2 o'clock now",
          "ni a. regal what is the price likely to be?",
          "ia nganggar umur aku kira tiga puloh taun, laban aku empu enda' te-ingat, he estimated my age at about 30, for I couldn't work it out (remember) myself",
          "aum a. belanja menoa, budget session (of the legislature)"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "anggat",
    "meanings": [
      {
        "definition": "Term of address or reference for young man or son-in-law, akan",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Now used for Mister (Mr.) of men, instead of Tuan. Opp. of ENDUN",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "Angglika",
    "meanings": [
      {
        "definition": "(Eng.) Anglican (Church), (formerly) es-pi-ji",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "anggok",
    "meanings": [
      {
        "definition": "Neck (or shoulder?) of any animal or bird, part of a deer allotted to him in whose noose (jarin) the deer is caught",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Siduai ia ma' a., the one is carrying the other pick-a- back",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Man's name",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "anggong",
    "meanings": [
      {
        "definition": "Batu a., large boulder, rock",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "A. -api, rock (a child) on one's feet when lying on the floor, usu. of woman and child",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "anggu'",
    "meanings": [
      {
        "definition": "Sling, supporting loop, hang by a tope or cord",
        "examples": [
          "tanggi ia be-a., his hat has a cord (to hang it by)",
          "ia nganggu'-ka tikai she hangs up the (rolled) mat",
          "ia nganggu' sengkuit, he makes a (cord) sling for the 'chicken scarer'"
        ],
        "synonyms": [
          "ANDOH"
        ]
      }
    ]
  },
  {
    "word": "anggup",
    "meanings": [
      {
        "definition": "Tweezers (usu. home-made of brass or depilation). Men who grow any beard carry a. to use casually. It used to be fashionable for a young man to have his eyebrows plucked out by a girl as he lay with his head in her lap. BANTUN",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "anggur",
    "meanings": [
      {
        "definition": "Signs of future events, plans, preparations, preliminaries, rumour, reckon, count on beforehand",
        "examples": [
          "tu' a. tikai, this is the beginning of a mat"
        ],
        "synonyms": [
          "bisi' a. Pieng ka' datai, there is a rumour the Pieng are coming; lama' bendar a. gawai sida', lalu enda' nyadi, there was a lot of talk about their feast but it didn't come off; ia datai. a. gawai, he came to help in the preparations for the festival; munyi a. orang kai ka' pegi, (you are) making as much fuss as if (you were) going on an expedition; ia enda' be-a. ka' bebini, he married without any previous announcement; ia nganggur-ka dulu' udali nya' baru ia bendar, he reckons (plans) the matter beforehand, afterwards he will do it in earnest"
        ]
      },
      {
        "definition": "(Pers., Hind.) Buah a., grapes; ai' a., wine; a. rangkai, raisins, kismis; leka a., (obs.) grape-shot",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "anggut",
    "meanings": [
      {
        "definition": "(M.) Nod, nod assent",
        "examples": [
          "ia mina nganggut ka aku, he merely nodded assent to me",
          "ia nganggut-ka pala', he nodded his head"
        ],
        "synonyms": [
          "AU'"
        ]
      }
    ]
  },
  {
    "word": "angi",
    "meanings": [
      {
        "definition": "(M., wangi) Sweet smelling, scented, aba, angit",
        "examples": [
          "minyak a., (manufactured) scent, perfume"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "angih",
    "meanings": [
      {
        "definition": "Blown, out of breath, ANGIS",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "angin",
    "meanings": [
      {
        "definition": "(M.) Wind, breeze, ribut",
        "examples": [
          "a. betiup kaya di malam, the wind blew hard last night",
          "nadai bisi' a. tengah hari, there is no breeze at midday",
          "lampu a., hurricane lamp",
          "mata a., (M.) magnetic compass, kumpas"
        ],
        "synonyms": []
      },
      {
        "definition": "Report, rumour, lie",
        "examples": [
          "jako' ia maioh a., his talk is full of lies",
          "berita a. (or andi), a rumour"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "angis",
    "meanings": [
      {
        "definition": "Puffed, blown, out of breath, perspire, angih",
        "examples": [
          "IRAK"
        ],
        "synonyms": [
          "hence"
        ]
      },
      {
        "definition": "Asthmatic, short-winded",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "angit",
    "meanings": [
      {
        "definition": "(M., hangit, 'foul-smelling') Fresh or fragrant smell, cause to smell sweet, flavour, aba, angi",
        "examples": [
          "bau a., sweet smelling",
          "a. bungai nya' malu-alu, those flowers have a strong sweet scent",
          "bungai tu' ti' ngangit bilik nuan, it's these flowers that make your room smell nice",
          "balat peng-a. bau bungai, the flowers are very fragrant",
          "ia ngangit-ka engkayu', she flavours the vegetables"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "angka",
    "meanings": [
      {
        "definition": "Perhaps, engka",
        "examples": [
          "a. ia enda' datai, perhaps he is not coming"
        ],
        "synonyms": []
      },
      {
        "definition": "(Skr.) Numerals, figures, arithmetic",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "angka'",
    "meanings": [
      {
        "definition": "(in Rejang) As far as, nangka', engga', naka'",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "angkai",
    "meanings": [
      {
        "definition": "Reveal (bantai), repeat, talk down",
        "examples": [
          "ia ngangkai-ka aku butang, he revealed that I had committed adultery"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "angkat",
    "meanings": [
      {
        "definition": "(M.) Lift, raise and carry",
        "examples": [
          "aku ka' ngangkat-ka lanji' ngagai sadau, I want to carry the padi baskets up to the loft",
          "ia ngangkat-ka apai tuai, he lifted (helped) the old man up"
        ],
        "synonyms": [
          "TANGGONG"
        ]
      },
      {
        "definition": "Rise, arise, leave one place for another",
        "examples": [
          "ia a. lalu begari', he got up and dressed",
          "apin a. kitai? shall we (not) make a move?",
          "sida' ber-a. tumu pagi, they depart early in the morning, ia udali a. ka menoa bukai, he has removed to another district",
          "ia ngangkat-ka aku ari rumah nya', he turned me out of that house",
          "cat pintu ter-a., the paint on the door blisters",
          "ia enda' ter-a. bejako enggau aku, he couldn't get on for talking to me",
          "ari ni peng-a. nuan? where have you come from (i.e., started from)?"
        ],
        "synonyms": [
          "ANGKUT"
        ]
      },
      {
        "definition": "Aku bejako' a. ia datai malu' aku, I was talking and he (got up and) came and struck me; ia nemu manok enggi' aku a. ia madali ka orang ia enda' nemu, he knew the fowl was mine, but he told people he didn't know",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Inherit",
        "examples": [
          "ia ngangkat-ka nama aki' ia, he inherits (has been given) the name of his (great) grandfather",
          "ia ngangkat-ka mudal apai ia, he inherits his father's property"
        ],
        "synonyms": []
      },
      {
        "definition": "BER-A., take or go off with the spouse of another",
        "examples": [
          "ia ber-a. enggau bini aku, he took my wife (from me)",
          "siduai ia ber-a., (of a man and woman both leaving home on marriage) they went off together, set up house together"
        ],
        "synonyms": []
      },
      {
        "definition": "Ai' a., spring tide, pasang ray a",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "Angki",
    "meanings": [
      {
        "definition": "(Skr., Angiras, associated with fire and light) Father of Dayang RACA. angkih. (Patani M., Brush-tailed Porcupine) For ANGKIS",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "angkis",
    "meanings": [
      {
        "definition": "Long-tailed Porcupine Trichys lipura lipura Gunther, angkih, smaller than LANDAK",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "angkong",
    "meanings": [
      {
        "definition": "Tree bearing a strong-scented diamond-shaped fruit, kind of wild mango, unid., (in Lemanak) BUNUT",
        "examples": [
          "endu' aku be-balong-ka a., my daughter uses the a. fruit for scent"
        ],
        "synonyms": []
      },
      {
        "definition": "(fig.) Buah a., head trophy, antu pala'",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Dwarf, undersized, poorly developed",
        "examples": [
          "a. orang, dwarf or midget"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "angkul",
    "meanings": [
      {
        "definition": "Sangkul-a., inseparable",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "angkun",
    "meanings": [
      {
        "definition": "Greedy, covet",
        "examples": [
          "anang a. -ka utai, don't be greedy to get property"
        ],
        "synonyms": []
      },
      {
        "definition": "Cherish",
        "examples": [
          "ia a. -ka anak ia, he is devoted to his child",
          "ngangkun hati, be devoted, steadfast",
          "ia ngangkun-ka-diri' enggau anak ia, he pretends to be devoted to his child",
          "nadai utai ngangkun nya', extremely devoted",
          "aku enggai enda' di-kangkun-ka nuan, you must take care of me"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "angkut",
    "meanings": [
      {
        "definition": "(M.) Carry, carry in many loads or continuously, shift, remove, esp. of bringing in the harvest",
        "examples": [
          "kami ngangkut ramu', we are bringing in lumber (for building)",
          "kami ber-a. diatu', we are humping home the harvest now",
          "sida' ber-a. -ka utai tuki ari kapal, they are carrying the merchant's cargo from the ship",
          "ber-a. semut, carry little by little (i.e., as ants do)",
          "sida' ber-a. ka Sut, they remove (usu. pindali) to the Sut"
        ],
        "synonyms": [
          "ANGKAT"
        ]
      }
    ]
  },
  {
    "word": "Anglika",
    "meanings": [
      {
        "definition": "(Eng.) Anglican (Church), Angglika",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ang-mo",
    "meanings": [
      {
        "definition": "(Ch., 'red face') European, Orang Putih",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ang-pau",
    "meanings": [
      {
        "definition": "(Ch., 'red packet') Money wrapped in red paper given at festivals, ampau",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "angu",
    "meanings": [
      {
        "definition": "Silly, foolish, fond",
        "examples": [
          "ia tak a., he's half-witted",
          "anang a., don't be disappointed",
          "lebu a., (poet, in pelandai) fond and foolish"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "angui",
    "meanings": [
      {
        "definition": "(of fish in shoals) Come inshore",
        "examples": [
          "ikan a. diatu', the fish are coming in now (e.g., of prawns off Saribas and Sadong in April and May?)"
        ],
        "synonyms": []
      },
      {
        "definition": "(of human beings) Feel oppressed by heat",
        "examples": [
          "aku a. laban panas, I am overcome by the heat"
        ],
        "synonyms": [
          "IRAK"
        ]
      }
    ]
  },
  {
    "word": "angus",
    "meanings": [
      {
        "definition": "(M., hangus) Burnt, on fire (api)",
        "examples": [
          "baju aku a., my coat is burnt",
          "rumah aku a., my house is on fire, burnt down",
          "ia ngangus-ka rumah, he set the house on fire",
          "ni baka peng-a. umai nuan? how did the firing of your clearing go?",
          "Perintah ngangus-ka rumah sida' menya' laban udu bebunoh, the Government burned their houses long ago because they were always feuding (killing)",
          "ngangus-ka dapur, offence of putting the house in risk and fear of fire (lit., letting the kitchen burn, i.e., not the whole house)"
        ],
        "synonyms": [
          "BETlf, RETONG, TUNU"
        ]
      }
    ]
  },
  {
    "word": "ani",
    "meanings": [
      {
        "definition": "Vigil (nampok), watch, look after (ibun), wait for (anti')",
        "examples": [
          "aku nyau sa-hari tu' ngani ia, I have been the whole day watching him. aniet. For ANIT, gnaw, etc. anih. Slime of decaying vegetable matter"
        ],
        "synonyms": [
          "ia muai a. sayur, she threw away the brown parts of the vegetables; sayur nya' be-a.-a., those vegetables are going rotten"
        ]
      }
    ]
  },
  {
    "word": "anit",
    "meanings": [
      {
        "definition": "Gnaw, nibble, tear off with the teeth",
        "examples": [
          "ia nganit buah, he got the skin of the fruit off with his teeth"
        ],
        "synonyms": []
      },
      {
        "definition": "Sip or suck out the juice of fruit, etc",
        "examples": [
          "tupai ka' nganit pinang, squirrels will suck out the juice of areca nuts"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "anjir",
    "meanings": [
      {
        "definition": "Rancid",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Fate, destiny, amulet for success in hunting or fishing",
        "examples": [
          "ia bisi' a. (or peng-a.), he has an a",
          "ia a. berikan, he is successful in fishing",
          "bai' a. ia bulih padi, it is his destiny to have good harvests"
        ],
        "synonyms": [
          "TUAH"
        ]
      }
    ]
  },
  {
    "word": "anjong",
    "meanings": [
      {
        "definition": "Convey, bring, send, take to a place, escort",
        "examples": [
          "anjong ma' tu', take this luggage",
          "sida' nganjong surat ka kubau, they take letters to the fort",
          "ia nganjong anak aku pulai ka lakiia, he escorts my daughter (who is) going home to her husband",
          "fa peng-a. pesan kami ngagai sanu' ti' bemalam di umai, he takes our message to those spending the night on the farm",
          "nganjong antu, bury the dead (lit., escort the soul, i.e., on its way to Sebayan) ', betampong nganjong, carry in relays"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "anjur",
    "meanings": [
      {
        "definition": "(M., 'slip out, escape') Delude, let down, back down",
        "examples": [
          "a. ia bejalai, he proposed to set out on a journey and then turned back",
          "ia nganjur-ka aku bejako', he began to speak for me and then said nothing more",
          "fa nganjur- ka aku makaigaji, he proposed we should enlist and then did not join"
        ],
        "synonyms": []
      },
      {
        "definition": "(M.) Stretch out, go beyond, jut out (julut)",
        "examples": [
          "ia nganjur-ka pejalai ia ka Simanggang, he goes right on to Simanggang",
          "ia nyau a., he is gone on, (fig.) he is dead",
          "ai' a., flood tide continuing longer than usual",
          "pasang a., slack water at neaps",
          "tel-a., gone past, gone too far"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ansa",
    "meanings": [
      {
        "definition": "Grind, sharpen, asah, kilir",
        "examples": [
          "a. duku' tu', sharpen this knife",
          "sida' nadai bemunyi utang ngansali pedang aja', they made no remarks but only sharpened their swords (i.e., used threatening behaviour)",
          "aku ga' mangali di-a. ia, I am (naturally) hot tempered (but) he whetted my anger"
        ],
        "synonyms": []
      },
      {
        "definition": "A. ngeli', laugh, usu. ketawa'",
        "examples": [
          "ia selalu ngansah ngeli' diri', he is constantly laughing"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ansak",
    "meanings": [
      {
        "definition": "(without -ka) Urge, incite, move towards",
        "examples": [
          "ia ngansak aku belay a', he egged me on to fight",
          "ngansak kitu' agi', move nearer mc",
          "atiang be-a. (-ka) oranggawa' tekelalu, don't make people work too hard",
          "orang peng-a., agitator",
          "ia ngansak bekereja ngasoli nuan bulih utai, he urged you to work in order that you might acquire property"
        ],
        "synonyms": [
          "PERANSANG"
        ]
      },
      {
        "definition": "(with -ka) Press back, drive back",
        "examples": [
          "sida' ngansak- ka munsoh, they drove the enemy back"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ansal",
    "meanings": [
      {
        "definition": "Suffer scarcity, be short of, run out of, ill-provided, pungkang",
        "examples": [
          "kami a. padi, we have very little padi left",
          "kami a. bendar, there isn't much in the house (apology to visitors)"
        ],
        "synonyms": [
          "SUNTOK"
        ]
      },
      {
        "definition": "Poor, umang",
        "examples": [
          "orang nya' a. bendar, that man is very poor",
          "balat peng-a. ia, he is in great poverty"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ansang",
    "meanings": [
      {
        "definition": "Gills of fish",
        "examples": [
          "baka keli' dalam ai' besambi' isi' besambi' a., (proverb) like the keli' fish in water, their flesh and gills are the same"
        ],
        "synonyms": []
      },
      {
        "definition": "The voice, speak noisily",
        "examples": [
          "anang kita' nebali a. dia'l don't make so much noise there!",
          "anang nebali a.! don't shout!",
          "inggar bendar a. nuan, you're making a lot of noise"
        ],
        "synonyms": []
      },
      {
        "definition": "Blossom of palms, usu. mayang",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ansar",
    "meanings": [
      {
        "definition": "Rub, scrub, shuffle",
        "examples": [
          "anang ngansar (-ka) kaki nuan, don't shuffle (or scrape) your feet about",
          "ia nukup buah niur ka peng-a. papan, he split a coconut to use (the half husk) for polishing the (floor) boards",
          "ia ngansar papan enggau sabut niur, she polishes the floor with a coconut husk. Floors are polished after spreading with a beeswax and kerosine mixture by putting one foot on the round of the half husk and skipping with it to and fro"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ansat",
    "meanings": [
      {
        "definition": "Shift, move, insit, pisah",
        "examples": [
          "ia ngansat-ka antara umai kami, he moved the boundary of our farms"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ansau",
    "meanings": [
      {
        "definition": "Look about in search of anything",
        "examples": [
          "ia ngansau pemakai, he looks about for food",
          "nger-a., ferret out"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "Ansin",
    "meanings": [
      {
        "definition": "Francis A. of Sibu, first Iban appointed to the Administrative Service, regarded as successor to Munan and made a Member of Council Negri in 1937",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ansing",
    "meanings": [
      {
        "definition": "Show off, demonstrate",
        "examples": [
          "ia ngansing- ka perau' pelumba' ia ti' baru, he showed off his new racing boat",
          "tanggoi ia baru di-a. -ka, lalu lenyau, he wore his hat just once, then it got lost"
        ],
        "synonyms": []
      },
      {
        "definition": "Set on, test, try",
        "examples": [
          "ia ngansing-ka ukui, he is trying the dogs (i.e., setting them on for the first time after training)",
          "fa ngansing- ka ubat bagas, he tested the effect of the amulet for diligence",
          "ia ngansing-ka kuligawa', he kept the coolies at it"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "anta'",
    "meanings": [
      {
        "definition": "Beau, dandy, gay, fond of fine clothes and jewellery",
        "examples": [
          "pungka' laki nya' nganta' bendar, that man is very fond of dressing himself up",
          "mdu' nya' selalu nganta', that woman is always wearing finery",
          "ia nganta' ka menyadi' ti' ka' datai, she is putting on her finery for (her) brother who is about to arrive",
          "ia nya' indu' peng-a., (sneering) she's always putting on finery"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "antah",
    "meanings": [
      {
        "definition": "(M., 'husk') Padi in the husk that still remains after pounding",
        "examples": [
          "beras tu'maioh a., this rice has a lot of padi in it",
          "aku makai enda' masok laban maioh a. di asi', I could not eat properly because there was a lot of padi in the cooked rice"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "antam",
    "meanings": [
      {
        "definition": "(M., Iientam) Strike, go on with",
        "examples": [
          "perau' ia di-a. gelumbang, his boat was struck by a wave",
          "a. meh! go on with it!"
        ],
        "synonyms": []
      },
      {
        "definition": "Because of, laban",
        "examples": [
          "aku nadai tau' tindok a. batok, I couldn't sleep because of a cough"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "antap",
    "meanings": [
      {
        "definition": "Cover, patch, lining, backing",
        "examples": [
          "a. baju, lining of a coat",
          "a. dudok, something to sit on",
          "aku ngantap baju aku, 1 put a lining in my coat",
          "aku ngantap keresi tu' enggau panggal, I put a cushion on this chair",
          "ia nulis be-a. -ka surat, he writes (with the paper resting) on a book"
        ],
        "synonyms": []
      },
      {
        "definition": "for ENTAP, level, flat",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "antara",
    "meanings": [
      {
        "definition": "(Skr.) Division between, boundary, nterval, separate, make a division or boundary, arjs, entara",
        "examples": [
          "ia ngantara-ka lay a' kami enggau P'nggai sa-singkap, he ended our quarrel (i.e., separated us) by (paying) a plate",
          "udali a. tiga hari baru ia kitu', after an interval of three days he came here",
          "ia dudok a. (or mentara) kami-duai, he sits between us",
          "lay a' nya' a. menoa kami enggau orang ulu ai', the dispute is between our district and the people upriver",
          "tu' a. menoa, this is the frontier, boundary",
          "aum a. bansa, international conference",
          "a. maia nebas enggau nebang, in the interval between cutting the undergrowth and felling",
          "umai kami-duai enda' bentara, there is no boundary between our farms",
          "a. dua enda', the chances are",
          "a. dua enda' datai ia temai tu', he may come this evening",
          "ia ngantara umai kami-duai, he made a boundary between our two farms"
        ],
        "synonyms": []
      },
      {
        "definition": "(Saribas only?) Pledges exchanged on marriage",
        "examples": [
          "siduai ia udah sarak, tang laki ia apin nyua'-ka a., they have divorced, but her husband has' not yet handed over the pledge (which should be returned)"
        ],
        "synonyms": [
          "DERIAN"
        ]
      }
    ]
  },
  {
    "word": "anti'",
    "meanings": [
      {
        "definition": "(M., nanti) Wait for, lie in wait for, ani, ibun",
        "examples": [
          "nganti' aku ba jalai, wait for me on the road",
          "a. menyadi' nuan datai, wait for your brother to come",
          "aku ka' nulis nganti' ia datai, I shall go on writing till he comes",
          "kami-duai be-a. pangan diri', we waited for one another",
          "kami-duai ber-a. di penyangkai, we arranged to meet at the landing-place",
          "aku datai ba peng-a. ari Hi' rumah sida', I arrived at the rendezvous below their house",
          "ngadang kijang alam babas, nganti' ai' enda' deras, to watch for a deer in the undergrowth (is) to wait for the river's current to run slow (i.e., a watched pot never boils)"
        ],
        "synonyms": []
      },
      {
        "definition": "Entertainment, hospitality, peng-a",
        "examples": [
          "manah bendar a. ia enggau aku, he did me very well"
        ],
        "synonyms": []
      },
      {
        "definition": "Defence in sword play or dance (ajat)",
        "examples": [
          "a. ia manah bendar, his defence is good",
          "ia landik nganti', he is good at defence"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "antin",
    "meanings": [
      {
        "definition": "(M., anting-anting) Ear-rings, ear pendants, a.-a",
        "examples": [
          "ia be-a., she is wearing ear-rings"
        ],
        "synonyms": [
          "ear, pending"
        ]
      }
    ]
  },
  {
    "word": "anting",
    "meanings": [
      {
        "definition": "Cut (pieces of wood) oT equal length",
        "examples": [
          "a. ia enda' bela', he hasn't cut them equal",
          "kayu' ia apin be-a., his wood is not yet cut into lengths",
          "ia nganting kayu' ka pagar, he is cutting lengths of wood for a fence"
        ],
        "synonyms": []
      },
      {
        "definition": "Cut off small branches from trees",
        "examples": [
          "ia agi' nganting (dan kayu'), he is still cutting off the small branches"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "antoh",
    "meanings": [
      {
        "definition": "Kind, gentle, be kind to or gentle with",
        "examples": [
          "ia ngantoh-ka diri' diatu', he has now become kind"
        ],
        "synonyms": []
      },
      {
        "definition": "Pillar frame of a spinning- wheel (GASING)",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "antok",
    "meanings": [
      {
        "definition": "(M.) Be sleepy, drowsy, buntau",
        "examples": [
          "anang ngantok leboh nuan jaga, don't be sleepy when you are on guard"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "antu",
    "meanings": [
      {
        "definition": "Spirit, demon, or devil that can enter into men, e.g",
        "examples": [
          "a. engkerasak, spirit of malicious gossip or scandal-mongering",
          "a. kepapas, spirit of envy",
          "a. rua', spirit of waste, greed, or extravagance",
          "a. tisil, spirit of misfortune. These cannot abide garu"
        ],
        "synonyms": []
      },
      {
        "definition": "Familiar spirit, esp. of ancestor, in whatever guise it appears",
        "examples": [
          "ia be-a., (or) ia bisi' a., hehas a familiar",
          "ia ber-a. bendar, he must have supernatural powers",
          "pengeraja ia (di-) beri' a., he is fabulously rich",
          "ia ngantu diri', he put on a fearful disguise"
        ],
        "synonyms": []
      },
      {
        "definition": "(in divination) Left medial lobe of liver (atau) relating to a",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "(in playing cards, terup) Joker; a card game",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Buloh a., bamboo, unid",
        "examples": [
          "kulat butoh a. ray a, inedible fungus, unid"
        ],
        "synonyms": []
      },
      {
        "definition": "The dead, a. SEBAYAN, esp. before burial and completion of rites",
        "examples": [
          "(at a war-memorial) bala menyadi' kitai ti' udah ber-a. -ka nyauia diri', all our brethren who gave their lives",
          "GAVVAI a., festival for the dead",
          "be-a., mourn",
          "nganjong a., (carry and) bury the dead (lit., escort the soul)"
        ],
        "synonyms": [
          "dead, PARA 1; grave, PENDAM"
        ]
      },
      {
        "definition": "A. pala', head trophy, dried head of an enemy, (also) balang, kelekuyang, niur, etc",
        "examples": [
          "kabak a. pala', old head trophies",
          "behead, pumpong, tajin. On returning from a successful foray, the boat is decorated with isang and a paean (panjong) raised. The trophies are smoked in a hut (langkau) built for the purpose over special hearthstones (bedilang) and are presented to the women at the head of the steps, who sing them home (taku, timang) and feast them. Afterwards the heads are hung in baskets (ringkaj from a ring-frame (bengkong) over the hearth in the ruai. It used to be necessary to get a new head before formal release from mourning (ulit), or to show evidence of bravery"
        ],
        "synonyms": [
          "women still taunt unwelcome suitors with never having brought a head home. Head-hunting as part of the rites of mourning was taught to Serapoh by Puntang Raga. The nikau asi' rite (casting of rice) is performed by old men fully armed who dance round and over the new heads as they lie in a capan basket on the open tanju' after their scrutiny of the pig's liver (atau). Souls of those killed in war inhabit the abode of Seganti"
        ]
      },
      {
        "definition": "Any denizen of another world, the first beings existing at the creation (PETARA), the first men (mensia) and the first race of giants, demons, and monsters (GERASI) of whom some inhabit the land of the dead (Sebayan) and of snakes (Panggau), some the wilder parts of this world",
        "examples": [
          "pansa' a., (be passed, brushed or touched by an evil a.) fall ill without apparent cause, become depressed. Gen., a. have something strange or inhuman about them, e.g., long fangs, much hair, misplaced features"
        ],
        "synonyms": [
          "(lapa takut, ukai a.) sigi' orang indu' (puki enda' melintang), (she's no monster to be scared of) just like any other woman (it isn't crossways on). Male a. inch",
          "Abu, Bay a (crocodile), Genali and Jelapi (of the waters), Beruroh, Buyu', Entibu Garong, Gereganjang (vampire), Kamba' (goblin), Kemping Padi, Sejawa (goblin), Sugan-ugun. Female a. include",
          "Pantan Ini' Andan (chief of those who dwell in heaven), Biku Indu' A. (chief of those on earth), Dara Rambai Geruda, Meni', and the snake deities of Panggau and Gelong"
        ]
      }
    ]
  },
  {
    "word": "antu'",
    "meanings": [
      {
        "definition": "Ngantu', come to assist",
        "examples": [
          "ia ngantu' aku, he came to my assistance",
          "ia ngantu' penusali kami, he helped us in our trouble",
          "kami maioli peng-a. nyabong kamari', we had a lot of supporters (helpers) at the cock-fighting yesterday"
        ],
        "synonyms": []
      },
      {
        "definition": "A. ai', sodden, saturated; batang tu' a. at', this log is waterlogged",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "A multitude of people, sentugu'",
        "examples": [
          "engkah di tikai awak-ka enda' tetigong-ka a. bala pengabang, put it on the mat so you won't be nudged (and have it upset) in the great crowd of guests",
          "a. bala munsoh dia', the enemy were in great strength there"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "antubuni",
    "meanings": [
      {
        "definition": "For ENTEMUNI', afterbirth",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "anu'",
    "meanings": [
      {
        "definition": "(M.) Some (thing), i.e., not specified",
        "examples": [
          "orang a. bisi' kitu' kamari', some people came here yesterday",
          "di menua a. ia diau, he lives in some country",
          "liari a. aku kitu', some day I shall come here",
          "orang a. (or SANLT), so-and-so",
          "rumah sanu' panjai bendar, such-a-one's house is very long",
          "aku betemu enggau a. tadi', I met what's-his-name just now",
          "aku betemu enggau ia di-a. tu'-di Kabong, I met him-let me see-in Kabong",
          "aku meda' bisi' utai nuan ba mija-a. tu'- sural, I saw there was something of yours on the table, a book"
        ],
        "synonyms": []
      },
      {
        "definition": "Interjection, oh! here! well!",
        "examples": [
          "a.! aku ka' nanya' nuan, aku ka' enggau nuan, oh! I want to ask you if I may go with you"
        ],
        "synonyms": []
      },
      {
        "definition": "Anger, be angry (ringat), rebuke (ajar), bother, annoy, tease",
        "examples": [
          "a. ia balat bendar dalam ia nunggu kami, his anger was great when he fined us",
          "a. ia! rebuke him!",
          "suah aku nganu' sida' utang sida' enda' ninga-ka jako' aku, often I was angry with them but they did not pay attention to my talk",
          "ia nganu' aku, he reprimanded me",
          "peng-a. bendar nuan tu', you are very harsh"
        ],
        "synonyms": []
      },
      {
        "definition": "Say, tell, speak to",
        "examples": [
          "pulai! NGANU' aku, go away! I told him",
          "bisi', nganu' ia, there are (some), so he said"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "anyai",
    "meanings": [
      {
        "definition": "(usu.) Kiai A., a title of KELING",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "anyam",
    "meanings": [
      {
        "definition": "(M.) Weave (of baskets and mats), braid, plait",
        "examples": [
          "indu' nyau ber-a., the women have started weaving baskets (i.e., the festival for the dead is near)",
          "ia nganyam ka aku tikai sa-lambar, she is making a mat for me",
          "a. ia apin tembu', she hasn't yet finished her weaving",
          "belakang ia ber-a. laban tikai, his back is marked with (the pattern of) the mat",
          "ia rindang be-a. (or ber-a.) tikai ka orang, she fritters away her time making mats for other people",
          "ia nya' indu' peng-a., she goes in for (or is good at) making mats and baskets",
          "a. apit, short heavy lines made in a piece of weaving",
          "a. belebus, stripes 'woven' with a needle (in loom woven cloth)"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "anyap",
    "meanings": [
      {
        "definition": "Grope in the dark, GAYAP",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "anyik",
    "meanings": [
      {
        "definition": "Provide or work for, ANDAI",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "anyil",
    "meanings": [
      {
        "definition": "Nganyil, (of insects) insert proboscis",
        "examples": [
          "manyi' nganyil bungai nya', the bee visited that flower",
          "indu' utai nya' nganyil pala' aku, that insect darted at my head"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "anying",
    "meanings": [
      {
        "definition": "Plaited rotan ornament on front clasp of woman's 'corset' (RAWAI), sentukul",
        "examples": [
          "tiga nyawa a., three (such) ornaments"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "anyir",
    "meanings": [
      {
        "definition": "(of food) Thin",
        "examples": [
          "bubur tu'a., this rice gruel is very thin",
          "ia nganyir-ka asi', she adds water to the rice (as it cooks)"
        ],
        "synonyms": [
          "ANGAU"
        ]
      }
    ]
  },
  {
    "word": "anyut",
    "meanings": [
      {
        "definition": "(M., hanyut) Adrift, drifting, drift in running water",
        "examples": [
          "perau' kami a., our boat is adrift",
          "ia nganyut-ka perau' aku, he set my boat adrift",
          "kami ber-a., we are drifting",
          "ber-a. kitai! easy all!",
          "aku nemu perau' (ke) di-per-a. -ka orang, I found a boat that had been set adrift",
          "ia peng-a. batang, his job is to fend off drifting logs"
        ],
        "synonyms": [
          "adrift in still water, pawa"
        ]
      },
      {
        "definition": "'Flooded' or 'awash' with something spilled",
        "examples": [
          "a. tikai laban darah, the mat was covered with blood"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ap",
    "meanings": [
      {
        "definition": "Interjection used in playing with a child",
        "examples": [
          "ATAH"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "apa",
    "meanings": [
      {
        "definition": "(M., interrogative) What?, NAMA",
        "examples": [
          "a. utai nya'? what's that?",
          "nyadi a., nyadi nama, nuan tu' ila'? what will become of you?"
        ],
        "synonyms": []
      },
      {
        "definition": "(M.) Nadai a.-a., all right, safe and sound, there's nothing the matter (with it); nadai nya' nyadi a. deli, never mind, don't worry",
        "examples": [
          "NAMA"
        ],
        "synonyms": []
      },
      {
        "definition": "(Swk.M., indah) Udah makai a. kitai bejalai, after eating and so forth we went on",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "apai",
    "meanings": [
      {
        "definition": "Father, term of address for men of father's generation",
        "examples": [
          "a. indai, parents",
          "scmua a. indai aku ti' di menoa, my parents and all my uncles and aunts at home",
          "a. orang, father of a family",
          "a. tuai, father's or mother's elder brother, aya'",
          "a. biak, father's or mother's younger brother",
          "ia jadi enggau a. orang, she married a man who was a father",
          "nadai a. orang makai gula enggau ikan masin, nobody (of sense) eats sugar with salt fish",
          "(coarse) anak nya' be-a. -ka manok (or babi) that child is a bastard (lit., has a cock, or boar, for a father)",
          "aku ngapai ia, I call him father"
        ],
        "synonyms": []
      },
      {
        "definition": "(of any respected and trusted leader or person in authority) Like a parent",
        "examples": [
          "Tuan Raja a. -indai kitai, the Rajah was our ruler (as a father to us)",
          "bala sida' lalu enda' be-a. -indai, their force then became disorganized (leadcrless, routed)"
        ],
        "synonyms": []
      },
      {
        "definition": "(of a priest, esp. of Church of Rome) Father, the Reverend",
        "examples": [
          "PEDERI"
        ],
        "synonyms": []
      },
      {
        "definition": "(in Batang Ai and Undup) A. andau, (poet., 'father of the day') star, BINTANG",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "A. Sali, typical yokel",
        "examples": [
          "empelawa' A. Sali, red spider, unid"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "apak",
    "meanings": [
      {
        "definition": "At, near (a place or time)",
        "examples": [
          "a. nya', at that moment",
          "a. endur nya', at that place"
        ],
        "synonyms": [
          "ABA"
        ]
      },
      {
        "definition": "Direction",
        "examples": [
          "aku bejalai ngagai a. menoa Entulu, I am going towards Bintulu",
          "kaban ikan nuju a. nya', a shoal of fish was moving in that direction. TAPAK (te-a.)"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "apal",
    "meanings": [
      {
        "definition": "(Ar.) Word perfect",
        "examples": [
          "ia a. bendar ka semua pelajar ia, he knows all his lessons thoroughly",
          "ia ngapal-ka leka renong, he learned the words of the songs by heart"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "apan",
    "meanings": [
      {
        "definition": "Open space frequented by deer and pigs, frequent such a place, salt lick, sungan, ugu. A. may be natural or made by a hunter near a machan (panggau, tempara')",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "apang",
    "meanings": [
      {
        "definition": "Duku' a., decorated Kayan sword, duku' ILANG. apap. F'oolish, mapap",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "apas",
    "meanings": [
      {
        "definition": "Out of sight, almost beyond earshot",
        "examples": [
          "a. mata meda', out of sight",
          "kukok manok a. pending dinga, (so far that) the crowing of a cock can only just be heard"
        ],
        "synonyms": []
      },
      {
        "definition": "Run short, ansal",
        "examples": [
          "nyau a. padi kami tu', we have run short of padi"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "apat",
    "meanings": [
      {
        "definition": "Litter, clutter",
        "examples": [
          "maioli bendar a. keretas ba bilik aku, my room is littered with paper",
          "bilik ia be-a.-a. laban perengka, his room is crowded with furniture"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "apei'",
    "meanings": [
      {
        "definition": "For API', old man",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "api",
    "meanings": [
      {
        "definition": "(M.) Fire, light, lamp (LAMPU), spark (in motor cylinder)",
        "examples": [
          "a. padam, the fire is out",
          "a. mau', the fire blazes up",
          "aku meda'a., I saw alight (or, fire)",
          "jako' ia be-a.-a., he speaks with passion",
          "sida' tindok be-a., they sleep with a (night) light (as many do, esp. with young children to tend)"
        ],
        "synonyms": [
          "ia nungkun (or ngidup) -ka a., she lights (or blows up, makes up) the fire', aku ngapi asi' aku, I made the fire bum up under nty rice; anang ngapi asi' nya' agi', don't cook that rice any longer; ia ngapi lay a' kami, he tanned our quarrel; udah ber-a. kita'l have you started (or done) the cooking?"
        ]
      },
      {
        "definition": "(M., bintangur kuning) Tree Calophyllum obliquinervium Merr.; (M.) A.-a., old name of Kota Kinabalu",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "A. Sebayan, fire kept alight near a corpse t^ ntil the burial",
        "examples": [
          "PARAI"
        ],
        "synonyms": []
      },
      {
        "definition": "Tiup a., Plaintive nckoo",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Bintang a., the planet Mars (?)",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "A. Bara', ('smouldering fire') praise name of Ngelingkang, ancestor of Tuang of Ulu Klauh and Penguin Ngali of Delok, whose remains are kept in the house at Engkramut",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "api'",
    "meanings": [
      {
        "definition": "(Ch., 'little white hair') Old man, apei'",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "(in playing cards, terup) King",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "apil",
    "meanings": [
      {
        "definition": "(Eng.) Appeal (in court case)",
        "examples": [
          "ngapil earn ngagai.... appeal the case to..."
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "apin",
    "meanings": [
      {
        "definition": "(in Saribas, Kalaka) Not yet, before",
        "examples": [
          "ia a. datai, he hasn't come yet",
          "a. ia makai telu' nya', before he ate the eggs",
          "a. bah, before the flood",
          "a. lama' (ti') udah, recently (lit., not yet a long time since)"
        ],
        "synonyms": [
          "EMPAI, BEDAU"
        ]
      },
      {
        "definition": "for PAN, PEN",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "aping",
    "meanings": [
      {
        "definition": "Wild palm, ijok, Arenga pinnata Merr. and others, which yields sugar, inferior sago, good but slightly bitter 'cabbage' (upa'), cordage (tali), and blowpipe darts (laja')",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Kulat a., edible fungus on palms, unid",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "apis",
    "meanings": [
      {
        "definition": "Small plaited rotan bag for betel (pinang), etc",
        "examples": [
          "KANDI"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "apit",
    "meanings": [
      {
        "definition": "Squeeze, press, kepit, kapit",
        "examples": [
          "aku ngapit jari ia enggau pintu, I squeezed his hand in the door",
          "sida' ngapit tebu, they are pressing sugar-cane",
          "sida' ngapit minyak, they are extracting oil",
          "tanah kena' a., (M.) land lying between lands owned by non-relatives"
        ],
        "synonyms": []
      },
      {
        "definition": "Next in order",
        "examples": [
          "tu' adi' ti' a. aku, this is my next younger brother (sister)",
          "ia dudok a. aku, he sits next me",
          "kami bejalai di-atur ia be-a.-a., we march in the order he arranges",
          "aku datai dulu', udah nya' ia ngapit aku, I arrived first, he came next"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "apoi! Interjection expressing surprise, wonder, admiration, apu, po: a.! ambis padi aku di-empa' jani', oh dear! all my padi is eaten up by pigs",
    "meanings": [
      {
        "definition": "",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "apoh",
    "meanings": [
      {
        "definition": "Go for anything adrift, render assist-ance, relieve",
        "examples": [
          "ia ti' ngapoli-ka perau' kami ti' anyut, he it was who went for our boat that was adrift"
        ],
        "synonyms": [
          "APONG"
        ]
      }
    ]
  },
  {
    "word": "apok",
    "meanings": [
      {
        "definition": "Fog, mist, apuk",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Dust, dirt",
        "examples": [
          "a. empelawa', (old) cobwebs"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "apong",
    "meanings": [
      {
        "definition": "(M., nipah) Stemless palm Nipa fruticans Wurmb., which lines the tidal reaches of many rivers (extensively in 1 st Div.). It yields atap (thatch), garam (salt from burning it), gula (sugar from tapping the flower), and daun rukok (tobacco wrappers from the young unopened leaf)",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Gerama' a., swamp crab, unid",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Collect or rescue anything that is adrift, apoh-. Pong ngapong perau' aku, Pong went after (and saved) my drifting boat; apai tuai nya' ngapong batang kompeni aba kaki Pelagus, that old man salvages the Company's logs (that are adrift) below the Pelagus (Rapids); ia ngapong kami ga' maia karam suba', he rescued us too that time our boat upset",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "apu",
    "meanings": [
      {
        "definition": "Common alternative pron. of APO, pu",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Plenty, much, many",
        "examples": [
          "tekelalu a. mau' api, sigi' durong-durong, the fire is burning far too fiercely, in fact it roars"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "apuh",
    "meanings": [
      {
        "definition": "(Swk.M.) Burong a., Cattle Egret, BANGAU",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "apuk",
    "meanings": [
      {
        "definition": "F'or APOK, fog",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "apus",
    "meanings": [
      {
        "definition": "Complete, finish, end",
        "examples": [
          "jako' ia apin a., he hasn't finished what he has to say",
          "a. malam, the whole night through",
          "a. ai', the whole river",
          "a. pikul, a full picul",
          "jalai nya' panjai, enda' a. tengah sa-hari, it's a long way, you can't do it in a day",
          "seput ia a., he has breathed his last",
          "ia udah ngapus-ka nyawa, he has finished his life",
          "ia bejalai ngapus-ka jalai, he walked the whole way",
          "ia agi' ngapus-ka ensera ia, he has still to tell the end of his story",
          "peng-a. ia lemai kamari', when he had finished yesterday evening",
          "tu' peng-a. aum kitai sa-hari-tu', that's the end of our meeting for today"
        ],
        "synonyms": [
          "PUPUS"
        ]
      }
    ]
  },
  {
    "word": "ara",
    "meanings": [
      {
        "definition": "Arrange different coloured stripes",
        "examples": [
          "tu' kelambi' a. (or be-a.), this is a jacket with stripes",
          "endu' ngara kelambi', my daughter is arranging the stripes of the coat"
        ],
        "synonyms": []
      },
      {
        "definition": "Petara tau' ngara nyawa kitai, the deity can arrange our fate",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "One of the two primeval birds (A. and Irik) who created the world",
        "examples": [
          "ENTALA"
        ],
        "synonyms": []
      },
      {
        "definition": "Pepan a., beam under loft floor",
        "examples": [
          "GELADAK"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ara'",
    "meanings": [
      {
        "definition": "Spread out to dry (of padi, pepper, coffee, etc.)",
        "examples": [
          "padi ti' di-jembui nuan legi' aku ngara' ia, the padi that you set to dry I will spread out by-and-by"
        ],
        "synonyms": []
      },
      {
        "definition": "Display",
        "examples": [
          "ia ngara'-ka penemu, he airs his knowledge"
        ],
        "synonyms": []
      },
      {
        "definition": "(M) Kayu' a., Parasite Fig, KARA'",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "arah",
    "meanings": [
      {
        "definition": "(Ar., 'direct, control') Check (a child), often with threat of a bogey man",
        "examples": [
          "a. anak nuan, anang ngasoh ia bay am duku', check your child, don't let him play with knives"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "arak",
    "meanings": [
      {
        "definition": "Urge",
        "examples": [
          "Perintah ngarak orang maioh nanam getali baru, the Government urges everyone to plant new (i.e., high-yielding) rubber",
          "ia peng-a. kami gawa', it's he who urges us on at work"
        ],
        "synonyms": [
          "PERANSANG"
        ]
      },
      {
        "definition": "(Ar.) Arrack, rice spirit distilled from a fermented mash (beram)",
        "examples": [
          "ia numi' (tumi') aku enggau a., she served me with arrack"
        ],
        "synonyms": [
          "PAK a., licensed distillery",
          "TUAK. Illicit stills are numerous",
          "Chinese prefer a home brew as a tonic for women after childbirth; in some places con-sumption by Iban is high"
        ]
      }
    ]
  },
  {
    "word": "aram",
    "meanings": [
      {
        "definition": "Exhortative interjection, am",
        "examples": [
          "a.! mandi' dulu'! come on! (let's) bathe first!"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "aran",
    "meanings": [
      {
        "definition": "(M., 'night-line') Long rotan or bark cable attached to crocodile 'hook' (ALIR)",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "arang",
    "meanings": [
      {
        "definition": "(M.) Charcoal",
        "examples": [
          "kami nadai be-a., we have no charcoal",
          "batu a., a. batu, coal. Coal was once worked at Brooketon and near Simunjan"
        ],
        "synonyms": [
          "it has been found at Silantik"
        ]
      },
      {
        "definition": "Gauiai basoli a., padi ritual",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "A. baya, (properly garang baya) gen. for trees of Hopea spp. with fissured bark, esp. H. garang buaya Ashton",
        "examples": [
          "LUIS, smooth bark kinds"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "arap",
    "meanings": [
      {
        "definition": "Faith, confidence, trust, rely on",
        "examples": [
          "aku a. -ka anak aku ngereja nya', I have confidence in my son (that he will) do that",
          "anang ngarap-ka diri' kering, don't trust (simply) in your strength",
          "tau' di-karap, trust-worthy, reliable",
          "peng-a. Keristian, the Christian faith"
        ],
        "synonyms": []
      },
      {
        "definition": "Hope",
        "examples": [
          "aku a. -ka ia datai, I hope he'll come",
          "aku gerai, a. -ka siduai gerai mega', I am well and hope that you two are well also",
          "aku ngarap-ka diri' bulih padi taun tu', I trust I shall get (a good harvest of) padi this year",
          "a. selama' beseput, (M., harap salagi nafas) while I breathe I hope (the Brooke motto, Dum Spiro Spero)"
        ],
        "synonyms": []
      },
      {
        "definition": "Slight itching on the skin",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "arar",
    "meanings": [
      {
        "definition": "Thread, a thread",
        "examples": [
          "UBONG"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "arau",
    "meanings": [
      {
        "definition": "Do anything quickly",
        "examples": [
          "enti' nimbak ngarau babi, if he goes shooting he soon gets a pig",
          "ia ngarau bendar bejako' enggau aku, he spoke to me very hurriedly",
          "aku tindok ngarau bendar, I slept for a very short time",
          "nebas umai enda' ulih di-a. sa-hari dua, you can't clear your farmland in a day or two",
          "ti' udah nemuai enggai ngarau, if I paid a visit I shouldn't want it to be a flying one",
          "a.! hurry up!"
        ],
        "synonyms": []
      },
      {
        "definition": "Tree, unid., of which the leaves are used as soap and the timber is light, strong, and durable for boats, said to be hard to find; cf. sengkajang",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "areh",
    "meanings": [
      {
        "definition": "Plaited rotan rope to which nooses of deer snare (jarin) are attached",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Pron. of ARIS, boundary, family",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "arei",
    "meanings": [
      {
        "definition": "Uncover, leave exposed, mengarei, ngarei",
        "examples": [
          "anang ngarei-ka duit tinggal di bilik, don't leave money lying about in the room",
          "a. -ka kasut nuan ngagai panas, put your shoes in the sun"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ari",
    "meanings": [
      {
        "definition": "usu. pron. of HARI, day",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "(M., dari) From, out of; ia bejalai sari-ari a. Lubok Antu lalu ka Kumpang, he walked the whole day from Lubok Antu to Kumpang; a. ni (pengangkat) nuan tadi'l where did you start from?; siko' a. kami tinggal, one of us was left behind",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "denoting relative position",
        "examples": [
          "a. kiba', on the left",
          "a. kanan, on the right",
          "niki' a. tangga', go up by the ladder",
          "aku ka' bejalai a. bukit, nuan nengah emperan, I'll take the high road, and you take the low road",
          "a. belakang, behind",
          "a. luar, outside",
          "embing a. tebing, go along the bank",
          "ia nimbak ka bukai a., he shot and missed",
          "jako' nuan ka bukai a., what you say is beside the mark"
        ],
        "synonyms": []
      },
      {
        "definition": "in comparisons",
        "examples": [
          "sigi' tu' manah agi' a. nya', this one is better than that",
          "ia ngereja nya' tau' agi' a. aku, he does it better than I do",
          "ia tinggi' a. sida' tiga, he is the tallest of the three"
        ],
        "synonyms": []
      },
      {
        "definition": "Work for payment, earn, do occasional work (for neigh-bour, who usu. pays with goods or services), exchange of labour (DUROK)",
        "examples": [
          "aku ka' ngari padi song nuan, I am going to work for you for padi",
          "ia ngari wang di aku, he works for me for money",
          "ia ngari aku beban, he works for me and I do some carpentry for him in return",
          "nya' a. ia, pay him for it by working for him"
        ],
        "synonyms": [
          "gen. work, employment, gawa', kereja"
        ]
      },
      {
        "definition": "Represent, act on behalf of",
        "examples": [
          "ia ngari-ka aku bejako', he speaks for me",
          "ia nyadi peng-a. menoa ngagai Council Negri, he represents his district in Council Negri"
        ],
        "synonyms": []
      },
      {
        "definition": "Show partiality",
        "examples": [
          "ia ngari-ka sida' arisepiak, he favours the other side"
        ],
        "synonyms": []
      },
      {
        "definition": "Ngari, move something aside",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "arih",
    "meanings": [
      {
        "definition": "Pron. of ARIS, AREH",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "aring",
    "meanings": [
      {
        "definition": "(M.) Bau a., foul or animal smell",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "aris",
    "meanings": [
      {
        "definition": "Boundary, division, usu. ANTARA",
        "examples": [
          "ia bumai ngelui-ka a., he farmed beyond the boundary"
        ],
        "synonyms": []
      },
      {
        "definition": "(Ar., waris) Line, family",
        "examples": [
          "a. sida' nyau ka' punas, their line is dying out",
          "ia. a. orang raja, he comes of a rich family",
          "tanah a., farm-land that has come to be allo-cated by the Tuai Rumah"
        ],
        "synonyms": [
          "PURIH"
        ]
      }
    ]
  },
  {
    "word": "aroh",
    "meanings": [
      {
        "definition": "Way, place, spot, fitting, put in the way of, suggest",
        "examples": [
          "ia ngiga' a. belay a', he seeks a way to quarrel",
          "tu' a. aku diau, this is the place (where) I live",
          "tu' a. jako', this is the right way to speak",
          "nya' a. hati aku, that suits me, it is exactly as I wish it",
          "ia ngaroh-ka aku bejako', he suggested how I should speak",
          "jako' nuan enda' a.-a., you are talking wildly",
          "a. aku ngukum nuan diatu', laban aku suah udah ngajar nuan, it is time I fined you, for I've warned you many times"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "arok",
    "meanings": [
      {
        "definition": "Soot, lamp-black, along, sooty, blacked",
        "examples": [
          "a. ba jari nuan, there is soot on your hands",
          "jari ia a., his hands are sooty",
          "ia ngikis a. ba burit kali, she scrapes the black from the bottom of the pan",
          "ia ngarok moa diri', he got his face black",
          "moa aku di-pukong a. ulih ia, my face was smeared with soot by her (in ragging about, or the game of 'do as I do' where each has a plate and one is blacked underneath)"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "arong",
    "meanings": [
      {
        "definition": "(M.) Mainstream, channel, current (iarus), direction, (Swk.M.) gully",
        "examples": [
          "tu' a. sungai, this is the (main) channel of the river",
          "a. ai', the (main) current of the water",
          "a. jalai, middle of the road, (in towns) footpath",
          "ni a. menoa nuan? in which direction is your country?",
          "tu' sigi' a. jako', this is generally admitted"
        ],
        "synonyms": []
      },
      {
        "definition": "Go up to and beyond, straddle, go on both sides of",
        "examples": [
          "ia bumai ngarong jalai, he farms on both sides of the road",
          "menoa kami udah kena' a. munsoh, our country has been overrun by the enemy",
          "tarit tali tu' ngarong-ka kayu' nyin, pull this rope to (stretch to) the other side of that tree",
          "(in racing) a. -ka tiang, keep outside the posts",
          "a. kerigai, chest (lit., cage of the ribs), (poet.) breast, heart"
        ],
        "synonyms": []
      },
      {
        "definition": "Gawai encabu-a., a war festival (obs.)",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "aru",
    "meanings": [
      {
        "definition": "(M., haru) Confusion, confuse",
        "examples": [
          "menoa a. laban munsoh, the country is all confusion because of the enemy",
          "sida' ngaru-ka menoa, they put the countryside into confusion"
        ],
        "synonyms": []
      },
      {
        "definition": "Getah tu' a. (or pelai') bendar, this rubber tree has a lot of latex",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "(M., a.-a.) A. bang, evil spell (UBAT) or demon harming children",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "aru'",
    "meanings": [
      {
        "definition": "Cook in a dry pan",
        "examples": [
          "ia ngaru' kopi, she roasts coffee beans"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "arum",
    "meanings": [
      {
        "definition": "(M., harum) Fragrant, ANGIT",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "arus",
    "meanings": [
      {
        "definition": "(M., Iiarus) Current (in stream), entali ai'. asa. For ASA' (deceive)?",
        "examples": [
          "(antu) buyu' a., evil spirit"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "asa'",
    "meanings": [
      {
        "definition": "expression of affection preceding the name",
        "examples": [
          "a. Ay a' Liba', my dear Uncle Liba'",
          "a. -mata, sweetheart, girlfriend (cf. aya'-sidak)"
        ],
        "synonyms": []
      },
      {
        "definition": "Disappointed, deceived, a.-a",
        "examples": [
          "a. bendar aku tadi', I was taken in just now",
          "ia ngasa'-ka anembiak enggau roti, he deceived the children with (a promise of) cakes"
        ],
        "synonyms": []
      },
      {
        "definition": "Nanya' a., plenti-ful",
        "examples": [
          "nanya' a. rusa' bisi' dia', there are many deer there"
        ],
        "synonyms": []
      },
      {
        "definition": "Make use of",
        "examples": [
          "ia ngasa'-ka kukut ia ngeris papan, he uses his fingernail to scratch the board",
          "ia ngasa'-ka orang bukai bejako' ka ia, he makes use of someone else to speak for him"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "asah",
    "meanings": [
      {
        "definition": "(M.) Sharpen, ansah, kilu",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Encour-age, ansak",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "asai",
    "meanings": [
      {
        "definition": "Taste",
        "examples": [
          "kati a. tuak nya'? manis a. ensepi' aku, how does that tuak taste? it tastes sweet to me"
        ],
        "synonyms": []
      },
      {
        "definition": "Feeling, feel, it's as if",
        "examples": [
          "ni a. runding nuan? what is your opinion?",
          "a. ka udah, I think I did",
          "ni a. utai? how are things going?",
          "a. apin tua betemu, I don't think we've met before",
          "a. diau ba rumah orang, I feel a stranger (in my own place)",
          "aku mimpi a. bejalai, I dreamed I was travelling",
          "nya' a. nuan, serves you right",
          "sepi' a. nuan ila'l I'll get my own back later!",
          "tau' a. nuan bejalai? do you think you can walk?"
        ],
        "synonyms": []
      },
      {
        "definition": "Feel, feeling, sensation, Per-a",
        "examples": [
          "enda' ber-a. celap nuan? don't you feel the cold?",
          "aku ber-a. ngelu, I feel giddy",
          "aku enda ber-a. tak nyu' ia, I lost control of myself and pushed him",
          "enda' ber-a. bulan abis, how time flies (lit., doesn't seem a month has gone)"
        ],
        "synonyms": []
      },
      {
        "definition": "Experience, test",
        "examples": [
          "aku ngasai-ka duku'sabilah tu' dulu', I'll try this knife first",
          "ia udah ngasai penyamai nyadi tuai, he has felt the pleasure of becoming a chief, asak. For GASAK, scrub"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "asal",
    "meanings": [
      {
        "definition": "(Ar.) Origin, race",
        "examples": [
          "nama a. nuan? aku sigi' a. Daya', what are you? I am pure Dayak",
          "ia sigi' orang ber-a., there is no mixture of races in him"
        ],
        "synonyms": []
      },
      {
        "definition": "Habit, peculiarity",
        "examples": [
          "sigi' a. nuan tu' pencuri, you're a born thief",
          "aku selalu meda' ia bejudi, endang a. ia ko' orang, I often see him gambling, (but) it's his habit, people say"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "asam",
    "meanings": [
      {
        "definition": "(M.) Sour, acid, sulky",
        "examples": [
          "a. buah nya', that fruit is sour",
          "a. moa ia, he is sulky (has a sour look)",
          "pirak a., alloy, base metal, nickel"
        ],
        "synonyms": [
          "MASAM"
        ]
      },
      {
        "definition": "(M.) Plants yielding sour fruit (used in preserves and for flavouring), esp. trees of Mangifera spp",
        "examples": [
          "a. empelam, M. indica L. and others",
          "a. jawa, Tamarind",
          "a. lanjoli, unid"
        ],
        "synonyms": [
          "a. lanyat, M. lagenifera Griff.; a. lempaung, Baccaurea lanceolata Miq. (Muell. - Arg.), gen. PUAK; a. panas, unid.; a. paya', Salacca conferta Griff., RIDAN; a. rebah, M. havilandi Ridl"
        ]
      }
    ]
  },
  {
    "word": "asap",
    "meanings": [
      {
        "definition": "(M.) Smoke, steam",
        "examples": [
          "a. api, smoke of a fire",
          "api ber-a., the fire is smoking",
          "tuboh ia ber-a., he is steaming",
          "ia ngasap getah, he is smoke-curing rubber"
        ],
        "synonyms": [
          "smoke tobacco, insap-, smoked (of meat or fish), salai"
        ]
      }
    ]
  },
  {
    "word": "asat",
    "meanings": [
      {
        "definition": "Moveable thwart in boat (PERAU')",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "asi",
    "meanings": [
      {
        "definition": "Obey",
        "examples": [
          "ia enda' ngasi-ka jako aku, he does not obey me"
        ],
        "synonyms": []
      },
      {
        "definition": "(M.) Fair, right, proper",
        "examples": [
          "enda' a. nuan bejako' munyi nya', it isn't right that you should speak like that"
        ],
        "synonyms": []
      },
      {
        "definition": "(Ar., ashik) Loved above all others, well-beloved",
        "examples": [
          "anak a. aku, my best beloved child"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "asi'",
    "meanings": [
      {
        "definition": "(M., nasi) Cooked rice",
        "examples": [
          "mandok a., cook (boil) rice",
          "makai a., eat, dine, have a proper meal",
          "sida' be-a. -ka jabang, they use tapioca instead of rice (i.e., during shortage or in poverty)",
          "a. salau, ritual meal eaten when taking omens (burong) and in pelian rites for the sick"
        ],
        "synonyms": [
          "uncooked rice, beras or berau; rice in the husk, padi"
        ]
      },
      {
        "definition": "Victim, dupe",
        "examples": [
          "aku nyau ka a. ia, I have become his victim",
          "orang dagang be-a. -ka orang ulu, traders take advantage of (or live off) country people"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "Asia",
    "meanings": [
      {
        "definition": "Asia, Asian",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "asil",
    "meanings": [
      {
        "definition": "(M., basil) Tithe, tribute, revenue, reward, profit, returns",
        "examples": [
          "wang a., head- or door-tax (in money)",
          "aku ka' ngasil nuan enti. ' nuan ka' nulong aku bicara, I will reward you if you will help me in my lawsuit",
          "bisi' a. bedagang kulu, there's money to be made by trading upriver",
          "enti getah lama', nadai tentu a. bekebun, if the rubber trees are old, there won't be much of a return from the garden. The former yearly tax in money or services was called a. by Malays, PUPU (contribution) by Iban"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "asing",
    "meanings": [
      {
        "definition": "(M., 'distinct, other') Orang a., stranger, foreigner",
        "examples": [
          "BUKAI"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "asit",
    "meanings": [
      {
        "definition": "Reveal, shoot out",
        "examples": [
          "mimit penyalah di-a. -ka ia, when there is the smallest fault he reveals it",
          "a. -ka igi' nya', make that seed shoot out (of its skin)"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "asoh",
    "meanings": [
      {
        "definition": "Order",
        "examples": [
          "tu' a. tuai kami, this is our headman's order",
          "enti' aku ngasoh nuan, enda' tau' enda' nitih, if I give you an order you must obey",
          "Aji Bulan ngasoh sida' ngaga' mit agi', Aji Bulan told them to make it smaller"
        ],
        "synonyms": []
      },
      {
        "definition": "Permit, allow, sagi",
        "examples": [
          "ai' besai enda' di-a. di-tubai, large rivers may not be fished with tubai"
        ],
        "synonyms": []
      },
      {
        "definition": "Make, cause",
        "examples": [
          "ujan ngasoh rumput bauh, rain makes the grass (grow) long, asta. (Skr., hasta, 'forearm') Measure of about 18 in., SETA"
        ],
        "synonyms": [
          "gen. measure SUKAT. asu. (M., 'dog') Ngasu, hunt, hunting, be-giga'; cf. asu'",
          "orang nya' telih leboh ngasu, that man was wounded while hunting; laki aku ngasu kamari', my husband was hunting yesterday; rusa' ba kaki tangga' enda' di-tunu, cit di tisi langit bekunda' ngasu, a bird in the hand is worth two in the bush (lit., the deer at the foot of the steps is not roasted but the rat at the edge of the sky is hunted with vigour); ia peng-a. bendar, he is a great hunter; jalai ngasu, faint trail"
        ]
      }
    ]
  },
  {
    "word": "asu'",
    "meanings": [
      {
        "definition": "(M., asu) Dog, hound, udok, ukui. Hounds may be derived from the wild dog (PASUN) but prob. not within Borneo. Hounds are named and well cared for where hunting is still done",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Engkabang a., tree Shorea palembanica Miq",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "Asun",
    "meanings": [
      {
        "definition": "Manang and Pengutu of the Entabai, whose title was Bah Tunggal ('Flash Flood') though he was not a war leader (tau' serang). His protests against official measures in 1929 led to widespread troubles which lasted until 1938. A. and his people were moved (batak) to the Igan but returned about 1943",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "asur",
    "meanings": [
      {
        "definition": "Profit, use, good",
        "examples": [
          "bisi' a. kitai belajar, there is benefit (to be had) in our learning (things)",
          "nadai GUNA, nadai a., there is no good or benefit (in it)"
        ],
        "synonyms": []
      },
      {
        "definition": "Push (something long and heavy), push along",
        "examples": [
          "anang ngasur-ka papan nya', don't push that plank",
          "ia ngasur-ka perau', he is pushing the boat (to get it into the water)",
          "batang kayu' nya' enda' te-a. ulih aku, I can't budge that log"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "atah",
    "meanings": [
      {
        "definition": "Interjection when encouraging children",
        "examples": [
          "AP"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "atai",
    "meanings": [
      {
        "definition": "Interjection of surprise or wonder, akai",
        "examples": [
          "a. utai mesai nya'! oh, the size of it!"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "atap",
    "meanings": [
      {
        "definition": "(M.) Thatch, roofing of any kind",
        "examples": [
          "a. apong, nipa thatch",
          "a. bata, a. batu, pantiles",
          "a. belian, ironwood shingles",
          "a. jing, roofing of corrugated iron or aluminium",
          "a. kayu', a. papan, wood shingles (other than ironwood)",
          "a. mulong, sago thatch (long-lasting)",
          "a. simin, asbestos roofing",
          "sengkawan a. udah laboh, a section of the thatch has fallen",
          "rumali kami be-a. daun, our house is leaf-thatched (usu. apong) -, ia ngatap rumah, he roofed the house",
          "langkau udah di-per-a. -ka kami, the hut was roofed by us"
        ],
        "synonyms": [
          "KASAU"
        ]
      },
      {
        "definition": "'Cover up' for poor neighbour esp. at festival",
        "examples": [
          "ia ngatap pengabang aku enggau pemakai, he provided (food) for my guests",
          "ia peng-a. ruai aku, it is he who provides for my guests",
          "enti' sa-pintu dua bulili padi enda' tau' ngatap kami maioh, if (only) a door or two get padi they cannot supply us all"
        ],
        "synonyms": []
      },
      {
        "definition": "Jerukan a., gift to infant guest",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "atas",
    "meanings": [
      {
        "definition": "(M.) Upon, above, over, (of position) upper",
        "examples": [
          "menaul nya' ngelayang a. perabong, that hawk is hovering over the root",
          "surat nya' di a. tikai, the book is on the mat",
          "ia niki' ka a. -ka agi', he climbed higher",
          "aku deka' ka a., I want to go upstairs",
          "ka a. ka baroh, up and down",
          "ia ari a. aku, he is my senior, superior",
          "ia dudok di a., he sits in the place of honour (on or by the pantar) -, belanja gawai nya' a. aku magang, all the expenses of the festival fall on me",
          "enti' bangkong nuan lenvau nya'a. aku, if your boat is lost it's my responsibility",
          "enti' kita' enda' ngereja nya' a. kita', if you don't do it that's your look-out",
          "aku deka' meri' nuan upah nya' a. ga' nuan ka' nyambut ia sa-tengah dulu', I will give you the reward if you will accept half to begin with",
          "aku bepanggai a. nuan, I am relying on you"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "atau",
    "meanings": [
      {
        "definition": "Liver, TUNGKUL a., heart (ATI)",
        "examples": [
          "besai bendar a. nuan lu', you are very ambitious"
        ],
        "synonyms": []
      },
      {
        "definition": "Be-a., merening-ka a., nelaga, ngelala, divine from scrutiny of a pig's liver (at every gawai where there is a PANDONG), an art given to men by SELEMUDA. The pig is killed after the invocation (pengap) and the reception of the heavenly guests (ngalu antu)",
        "examples": [
          "it will have been cleaned (nyugu) and fed by women and a woman holds the plate to receive the liver. The plate has 'croton' (sabang) leaves in it and is held on a folded cloth (pua'). Set nearby is a trough (dulang) with water, stone, sabang leaves and the point of a spear in it. The older men decide (on the tanju', before dis-playing it inside the house) what the liver foretells from its general condition, the shape and direction of folds and lines, the appearance of the gall-bladder, etc. 1 gi' sabang, pimples and lumps of a healthy kind, are good and foretell the gaining of head trophies. The parts of a liver (seen from the visceral side, which is that scrutinized)"
        ],
        "synonyms": [
          "buali sabong, unid.; petara (empu), left lateral lobe; terasit, leresit, antu, left medial lobe (or, teresit, both left lobes together); mensia (empu), right medial and lateral lobes; terinsong, terentong, empuyong, sempuyong (or dulang) Selempandai, (in Undup) dulang gayu, caudate lobe; anak hati, quadrate lobe (in Ulu Ai inch in teresit); empedu, gall-bladder; andau (bridge), tali kelingkang (cord of the offering basket), cystic duct"
        ]
      },
      {
        "definition": "(poet., for euphony, Tor) Atas, above",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ati",
    "meanings": [
      {
        "definition": "(M., hati) Heart, feeling, mind, disposition, (written hati)",
        "examples": [
          "belem-a., ber-a., ngem-a., think of, take an interest in, observe",
          "ngati, act according to inclination, do as you please",
          "sama ngati-ka diri', each pleasing himself",
          "anang ngati-ka diri', don't do it without advice",
          "anak a., quadrate lobe of liver (atau)",
          "a. tunggang, upset, disappointed",
          "besai a., boastful, talking big",
          "dengki a. enggau, have a grudge against (or feud with)",
          "di-a., involved in (as members of a group)",
          "enda' manali a., not to be trusted",
          "endang a. aku ka', I meant to",
          "gaga a., gagit a., glad",
          "kempang a., bold enough, dare to",
          "mangah a., unkind",
          "nelap a., kind, kindly",
          "ngasoh a. mutus, inspire with confidence, seem to be trustworthy",
          "panas a., angry, hot- tempered",
          "panas a. enggau (or ka), be angry or annoyed with (or at)",
          "penembu' a., satisfaction, content, pleasure",
          "sati (sa-a.), of one mind, agreed",
          "tembu' a., contented, pleased",
          "TUNGKUL a., (in Undup, Balau) liver, atau",
          "tusah a., disturbed, troubled, upset",
          "ukai a. aku endang, I didn't deliberately"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "atih, atis",
    "meanings": [
      {
        "definition": "Exclaim",
        "examples": [
          "ia ngalih-ka aku meda' aku merejok, he exclaimed on seeing me jump"
        ],
        "synonyms": []
      },
      {
        "definition": "Exclaim and egg on",
        "examples": [
          "anang ngalis-ka orang belaya', don't (call out and) encourage people to quarrel"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "atong",
    "meanings": [
      {
        "definition": "Allow to lloat or drift, but under control",
        "examples": [
          "ia ngatong perau' ia sa-malam-malam, he let his boat float all night (i.e., having moored it so)",
          "minyak nyau ambis lalu kami ber-a., kili' ngagai pasar, our fuel ran out so we drifted down (till we came) to the bazaar"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "atur",
    "meanings": [
      {
        "definition": "(M.) Arrangement, order, decision, arrange, set in order, decide",
        "examples": [
          "bala baru ngatur- ka diri' angkat, the army has just made arrange-ments to move",
          "a. ia enda' tentu, his decision is all wrong",
          "a. laya' nya', decide that quarrel",
          "a. pemakai sida' manah bendar, their arrange-ments for feeding are good",
          "tu' a. Perintah, this is the Government order",
          "ia ngatur kami gawa', he supervises our work",
          "ia ngatur orang nganjong aku mudik, he arranged for me to be taken upriver",
          "tu' endang di-a. -ka aku, it is my duty, I am instructed to",
          "pengawa' tu' di-a. ka nuan, this work is allotted to you",
          "udah ngatur diri' ia? has he married?",
          "a. -an, orders, by-laws",
          "peng-a., organizer",
          "a. be-lebih, additional or supplementary provision (of funds etc.)"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "au",
    "meanings": [
      {
        "definition": "Have a longing for a thing to eat it",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "au'",
    "meanings": [
      {
        "definition": "Affirmative, yes, indeed, give assent, agree to, accept",
        "examples": [
          "ia udah ngau' ka aku, he said yes to me",
          "ia ngau'-ka jadi enggau aku kamari', nama kabuah ia enggai agi' deli? she agreed yesterday to marry me, why is she no longer willing?",
          "a. la, (ironic, denoting disbelief or refusal)"
        ],
        "synonyms": [
          "ANGGUT"
        ]
      }
    ]
  },
  {
    "word": "auh",
    "meanings": [
      {
        "definition": "Echo, sound, noise, hum, murmur",
        "examples": [
          "a. bala, hum of an army or crowd",
          "a. ribut (ujan), noise of wind (rain)",
          "a. wong, the sound of a waterfall"
        ],
        "synonyms": [
          "RAUH"
        ]
      }
    ]
  },
  {
    "word": "aum",
    "meanings": [
      {
        "definition": "Council, meeting, debate, miting",
        "examples": [
          "a. kami putus, our meeting is concluded",
          "kami baum lemai tu', we are (holding a) meeting tonight"
        ],
        "synonyms": [
          "RANDAU"
        ]
      },
      {
        "definition": "Agree, resolve, decide",
        "examples": [
          "nama a. kita'? what is your agreed decision (i.e. after discussion)?",
          "siduai ia baum pindah ngagai menoa baru, the two of them resolved to move to new land",
          "nama utai di-paum-ka orang? what was decided?"
        ],
        "synonyms": []
      },
      {
        "definition": "Soothe, pacify (a child), gaum",
        "examples": [
          "ia ngaum anak ia ti' nyabak, she quiets her child who cries"
        ],
        "synonyms": []
      },
      {
        "definition": "Include, gaum",
        "examples": [
          "a. mega' sida' enggau kitai, reckon them also with us",
          "semua sida' sa-ratus enda' ngaum indu' anembiak, they number 100 in all not including women and children",
          "ampat tuboh kami, lima' ngaum nuan, there are four of us, five including you"
        ],
        "synonyms": []
      },
      {
        "definition": "SAUM (se-a.), have in common",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "A. -juak, double-faced, 'twister', one who expects bribes or rewards from both sides",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "aur",
    "meanings": [
      {
        "definition": "(M.) Buloh a., gen. for kinds of large bamboo, payan, esp. Gigantochloa scortechinii",
        "examples": [
          "a- gading, Bambusa wrayi (pale yellow with very hard skin)",
          "pating a. gangging, plant in the land of the dead (lit., stem of a small a. bamboo). A. is often mentioned in poetry, esp. n descriptions of women. It was the kind used[ or inflicting the death penalty for incest[ mail), instituted by Surong Gunting, in which (be guilty couple were bound together in cloths (puaj, thrown into a grave and impaled on bamboo (pantang a.)"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "aus",
    "meanings": [
      {
        "definition": "Thirst, thirsty, be thirsty",
        "examples": [
          "enggau madam-ka a., a drink to quench thirst",
          "aku a., I am thirsty",
          "ikan masin ngaus-ka nyauwa, salt fish makes one thirsty",
          "makai gula ngasoh a., eating sugar makes you thirsty",
          "balat peng-a. aku, I am very thirsty"
        ],
        "synonyms": []
      },
      {
        "definition": "Fade, wear out",
        "examples": [
          "bungai kelambi' ia a., the colour of her jacket fades",
          "batu ti' ngaus-ka duku', it is stones that wear out the bush knife"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "awa",
    "meanings": [
      {
        "definition": "She became his wife and he cut up the first child to become useful plants",
        "examples": [
          "PEREMAN"
        ],
        "synonyms": []
      },
      {
        "definition": "Woman's name, Eve, Iba",
        "examples": [
          "Adam enggau A., Adam and Eve"
        ],
        "synonyms": []
      },
      {
        "definition": "Word used to begin (ngadang) sections of manang recital, hu-ah (?)",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "A.-a., empty-handed, disappointed; nyau ka a.-a. ia datai di rumah, siko' orang pen nadai dia', he was disappointed when he got to the house, for there was not a soul there",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "Awai",
    "meanings": [
      {
        "definition": "Mandai A., river in the land of the dead",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Bukit A., high hill on forest routes between the Lubang Baya (Ulu Ai) and the Gagang (tributary of the Katibas), formerly well-known as a battleground esp. when engkabang were bearing",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "awak",
    "meanings": [
      {
        "definition": "Space, room, gap, vacancy, oppor-tunity, give room, make way, allow, let",
        "examples": [
          "jalai tu' nadai temu a. agi', you can't get through this way any more",
          "nadai bisi' a. endur dudok di bilik ia, there is nowhere to sit down in his room",
          "silak a. nanga, width of estuary, opening out of river where it meets the sea",
          "antara a. tebas aku, in the space I left uncleared",
          "bisi' a. alai aku bekereja? is there a vacancy for me (to work)?",
          "ia muai a., he threw away his chance",
          "jako' ia be-a.-a., there were gaps in what he said",
          "ia enggai ngawak-ka aku bejako', he will not let me speak",
          "kami ngawak-ka alai ia dudok, we made room for him to sit down",
          "ia ngawak jalai ka aku, (or) ia ngawak-ka aku jalai, he made way for me"
        ],
        "synonyms": [
          "RAWAK"
        ]
      },
      {
        "definition": "A. -ka",
        "examples": [
          "(a) (imperative) a. -ka ia bemain enggau ayam nuan, let him play with your toys",
          "(b) (in order to) anang inggar a. -ka ninga jako' ia, be quiet to that we can hear what he says",
          "(c) let be, don't fuss, leave well alone, let it go at that"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "awal",
    "meanings": [
      {
        "definition": "(Ar., Swk.M.) Early (tumu), punctual punctilious",
        "examples": [
          "aku a. tindok lemai kamari', I went to bed early last night",
          "a. -a. -ka nuan datai pagila', Come early tomorrow",
          "ia a. ka semua pangan ia, he is attentive to all his friends"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "awan",
    "meanings": [
      {
        "definition": "(M.) Cloud, REMANG",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Man's name",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "Awang",
    "meanings": [
      {
        "definition": "For ABANG, M. title, awas. (M.) Alert, ready, on watch; a.! belanda'! (starting a foot race) (get set) ready! go!; mata ia a. bendar, he has very sharp eyes",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "awi",
    "meanings": [
      {
        "definition": "Cloth cover, coverlet, counterpane, bedspread, shawl",
        "examples": [
          "ia be-a.-a., she is wearing something round her shoulders"
        ],
        "synonyms": [
          "AMPAI"
        ]
      }
    ]
  },
  {
    "word": "Awik",
    "meanings": [
      {
        "definition": "Tributary of the Kalaka",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "aya'",
    "meanings": [
      {
        "definition": "Uncle, stepfather",
        "examples": [
          "ibu', aunt"
        ],
        "synonyms": []
      },
      {
        "definition": "(M., ayah) Term of address for men of speaker's father's generation, term of reference for the hearer's father",
        "examples": [
          "aku betemu enggau a. ensana', I met your father the day before yesterday",
          "nuan patut ngaya'-ka aku, you should call me a"
        ],
        "synonyms": []
      },
      {
        "definition": "(poet.) Term of respect for deities of Panggau and Langit",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "A. -sidak, girl's sweetheart (cf. asa'-mata)",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ayah",
    "meanings": [
      {
        "definition": "Hurt, tease, persecute",
        "examples": [
          "anang ngayah- ka menyadi' di, don't tease your brother",
          "ngayah-ka aku bendar ia tu', he has given me a lot of bother"
        ],
        "synonyms": []
      },
      {
        "definition": "(of birds, animals) Attack, plunder",
        "examples": [
          "buah nyau ambis di-a. entamba', the fruit has all been taken by the flying- foxes",
          "pipit nya' burong peng-a. padi, Munia are a scourge of the padi fields"
        ],
        "synonyms": []
      },
      {
        "definition": "(of illicit intercourse) Siduai ia ngayah-ka hari, those two are having an affair (lit., harming the day, and liable to cause disaster, kudi'?)\\ ia ngayah-ka bini orang, he made love to another's wife",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Ngayah-ka utai, be careless (wasteful) with",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ayak",
    "meanings": [
      {
        "definition": "Monitor lizard, usu. BAYAK",
        "examples": [
          "sarak tua nunda' a. melaki bini, let us part (divorce) after the fashion of the lizard (i.e., without ceremony or fuss)"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ayam",
    "meanings": [
      {
        "definition": "Plaything, toy, pet (pinan), 'treasure'",
        "examples": [
          "udok a., pet dog",
          "a. ribut, weather-cock, weather-vane, toy spun about by the wind",
          "a. sepu, toy balloon",
          "a. anak patong, playthings (toys and dolls)",
          "bayam (be-a.), be fond of, treasure",
          "ngayam, play with (as a toy)"
        ],
        "synonyms": [
          "game, play, main"
        ]
      }
    ]
  },
  {
    "word": "ayan",
    "meanings": [
      {
        "definition": "Leave to be seen, or carelessly",
        "examples": [
          "aku ngayan-ka padi sa-gantang di bilik, I left a gantang of padi (uncovered) in the room",
          "ia ngayan-ka pelekat, he displayed a notice"
        ],
        "synonyms": []
      },
      {
        "definition": "Appear, be seen, visible, showing",
        "examples": [
          "maia langkang ai' bisi' a. Batu Nabau, Dragon Rock shows when the water is low",
          "semua jelu nadai agi' a., all the animals have disappeared",
          "lapa ia nadai a. sa-hari-tu'? why hasn't he shown up today?",
          "lemai mari' ia ngayan-ka berita ia amat, last night he let out the real story"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ayap",
    "meanings": [
      {
        "definition": "Vanished",
        "examples": [
          "duku' laboh lalu a. alam lubok, the knife fell and disappeared into the pool"
        ],
        "synonyms": []
      },
      {
        "definition": "Dim, dark, petang",
        "examples": [
          "bilik tu' a. laban lindap madang buah, this room is dark because it is shaded by fruit trees"
        ],
        "synonyms": []
      },
      {
        "definition": "Grope in the dark, anyap, GAYAP",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ayas",
    "meanings": [
      {
        "definition": "Faint, dim",
        "examples": [
          "tulis tu' a., this writing is faint",
          "aku nemu tang agi' a., I know, but it's still obscure (to me)"
        ],
        "synonyms": []
      },
      {
        "definition": "Vanished, out of sight (because of distance)",
        "examples": [
          "kapal terebai nyau a. ari mata, the aeroplane is out of sight"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ayat",
    "meanings": [
      {
        "definition": "Pinang a., wild areca palm, unid",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "(Ar.) Verse (in the Bible), paragraph; cf. enteran",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ayok",
    "meanings": [
      {
        "definition": "Shadow, kelemayang",
        "examples": [
          "enti' kitai mandang-ka jari ngagai lampu, kitai me da' a. ia ba dinding, if you put your hand in front of the lamp, you see its shadow on the wall"
        ],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ayong",
    "meanings": [
      {
        "definition": "Shade, cover, overshadow, alok",
        "examples": [
          "a. -ka paung kupi nya', anang ia kena' panas, shade those coffee seedlings, don't let them feel the heat",
          "sayur aku a. laban rumali, my vegetables are in the shade of the house",
          "tanggi ngayong langit, kelambi' ninding kulit, a sun hat shields one from the sky, a jacket protects the skin (e.g., when weeding or harvesting)",
          "sayur aku di-a. rumput bauh, my vegetables are choked by long grass",
          "balat endar peng-a. rumah sida' nya', their house is in very deep shade",
          "be-a., cover up, cover over"
        ],
        "synonyms": [
          "PAYONG"
        ]
      }
    ]
  },
  {
    "word": "ayu",
    "meanings": [
      {
        "definition": "(Skr., 'life, vitality') Shade or image of the living, reflecting gen. state of body and soul, with no independent existence as the SEMENGAT (soul) has and distinct from SUKAT (life span) and SEBAYAN (the dead) which have no a. The a. are like bamboo or banana and grow in clumps at Bangkit on a broad ridge, Bukit Menebong Jawa, where they are tended by Menyayan, chief of the celestial manang, esp. in rites for the sick (SAUT). If evil spirits (antu) attack the a. (they cut it down and burn it for their farming) the body sickens",
        "examples": [
          "when the soul leaves the body in dreams or sickness, the a. also sickens and wilts. It withers and dies altogether when the soul departs this world at death. Menyayan transplants (nusup) the a. from (family) clump to clump (kampong genturong) as necessary and clears away those that are dead"
        ],
        "synonyms": []
      },
      {
        "definition": "Health and strength, high (or low) spirits, in good (or bad) form",
        "examples": [
          "alah a., short lived",
          "sabang a., sabang planted to mark recovery from illness",
          "bulu tuai, in poor spirits or health (refers to the falling of dead leaves from the a. without real or lasting harm being done)"
        ],
        "synonyms": []
      },
      {
        "definition": "Meaning of dream or omen",
        "examples": [
          "ngayu, warn, foreshadow",
          "manyi' mansa' umai ngayu-ka bulih padi, (a swarm of) bees passing the farm means a good harvest"
        ],
        "synonyms": []
      },
      {
        "definition": "(in Bugau) No, not, nadai, enda'",
        "examples": [],
        "synonyms": []
      },
      {
        "definition": "Vatu A., ancestor of some of the people of the Padeh (Saribas) about 400 years ago",
        "examples": [],
        "synonyms": []
      }
    ]
  },
  {
    "word": "ayun",
    "meanings": [
      {
        "definition": "(M.) Swing, tayun (te-a.) WA'",
        "examples": [
          "tu'a. anak aku, this is my child's swing",
          "ribut ngayun-ka dan kayu' kin kitu', the wind sways the branches to and fro",
          "ia ngayun-ka jari, he swings his arms",
          "ia ngayun-ka wa', she pushes the swing",
          "ia ber-a. (diri'), he sits and swings",
          "ber-a., swing low to the ground"
        ],
        "synonyms": []
      },
      {
        "definition": "Equivalent in plates, etc., of a money 'fine'",
        "examples": [
          "pinggai tu' a. sa-ringgit, these plates are the equivalent of one dollar",
          "ia ngayun-ka sa-ringgit enggau pinggai, he paid a dollar 'fine' (tunggu) with plates"
        ],
        "synonyms": []
      },
      {
        "definition": "Indu' a. kaki, small black wasp, unid., similar to jagai",
        "examples": [],
        "synonyms": []
      }
    ]
  }
]
